;===============================================================================
; userMac.ks
;								¥Þ¥¯¥í¶¨Áx¥Õ¥¡¥¤¥ë
;
;										2010/07/26 UCHINO KAZUYUKI
;										Copyright 2009 (C) NanoMicron/Parasol
;===============================================================================
; ¡ö¥³¥Þ¥ó¥É¤Î½âÕh
; 
;¡¾ Àý ¡¿
;	¡ð¥Õ¥¡¥¤¥ë¤ÎÕi¤ßÞz¤ß								£º¥³¥Þ¥ó¥É¤ÎÕhÃ÷
;		file		: ¥Õ¥¡¥¤¥ëÃû						£ºÐ¡ÎÄ×Ö±íÓ›¤ÏÊôÐÔÃû
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0)				¡¡
;		[pos]		: Î»ÖÃ£É£Ä (def:0)					¡¡[ÊôÐÔÃû]¤ÏÊ¡ÂÔ¿ÉÄÜ¤ÊÊôÐÔ¤Ç¤¹¡£
;		[x]			: £Ø×ù˜Ë (def:0)					¡¡(def:)¤ÏÊ¡ÂÔ¤·¤¿ˆöºÏ¤ËÊ¹ÓÃ¤µ¤ì¤ë‚Ž¤Ç¤¹¡£
;		[y]			: £Ù×ù˜Ë (def:0)					
;	¡ù×ù˜Ë¤òÊ¡ÂÔ¤·¤¿ˆöºÏ¡¢½~Œ×ù˜Ë(0, 0)¤¬ƒžÏÈ¤µ¤ì¤Þ¤¹	£º²¶×½
;[macro name = macLoadImage]							£º¥ª¥ê¥¸¥Ê¥ë¥¿¥°Ãû
;	¡«¡«¡«												£º
;[endmacro]												£º
;
;
;	¡ùÉÏÓ›¤Î¤è¤¦¤Ë¥Þ¥¯¥í¤¬ÔO¶¨¤µ¤ì¤Æ¤¤¤¿ˆöºÏ¡¢¥·¥Ê¥ê¥ª¥¹¥¯¥ê¥×¥ÈÉÏ¤Ç¤Ï
;	
;	[macLoadImage file=*** layer=0 x=* y=*]
;	
;	¤È¤¤¤¦ÐÎ¤ÇÖ¸¶¨¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹
;	¡ùÊôÐÔ‚Ž¤ÎÇøÇÐ¤ê¤Ï°ë½Ç¥¹¥Ú©`¥¹¤Ç¤¹
;
;
;
; ¡ùÊôÐÔ¤ÇÖ¸¶¨¤¹¤ë¥Õ¥¡¥¤¥ëÃû¤Ë¤Ä¤¤¤Æ
; 
; 9§9’ˆˆ×Ó¤ÏÊ¡ÂÔ¤·¤ÆÓ›Êö¤·¤Æ¤¯¤À¤µ¤¤
;
; 9§9¥À¥Ö¥ë¥¯¥©©`¥Æ©`¥·¥ç¥ó¤ÎÓ›Êö¤Ï²»Òª¤Ç¤¹¤¬¡¢¥Õ¥¡¥¤¥ëÃû¤Ë°ë½ÇorÈ«½Ç¥¹¥Ú©`¥¹¤¬
; ¡¡¤¢¤ë¥Õ¥¡¥¤¥ë¤ÏÖ¸¶¨¤¹¤ë±ØÒª¤¬¤¢¤ê¤Þ¤¹
; 	¡¾ Àý ¡¿
; 	[macPlayBgm file="one dream"]
;
; 9§9Œê¥Õ¥©©`¥Þ¥Ã¥È¤ÏÒÔÏÂ¤ÎÍ¨¤ê¤Ç¤¹
; ¡¡Òô˜S¥Ç©`¥¿			: ogg/wav
; ¡¡¥°¥é¥Õ¥£¥Ã¥¯¥Ç©`¥¿	: bmp/jpg/png
; ¡¡¥Ó¥Ç¥ª¥Ç©`¥¿		: mpg/wmv
;   wmv¤òÊ¹ÓÃ¤¹¤ë¤Ë¤Ï Windows Media Player9 ¤¬PC­h¾³¤Ë¥¤¥ó¥¹¥È©`¥ë¤µ¤ì¤Æ¤¤¤ë±ØÒª¤¬¤¢¤ê¤Þ¤¹


;
; ¡ù¥¿¥°Ãû¤Ë¤Ä¤¤¤Æ
; ¡¡¥æ©`¥¶¥¿¥°¡¢kag¤Î¼È´æ¥¿¥°Ãû¤Ï¡¢Ð¡ÎÄ×Ö´óÎÄ×Ö¤Ê¤É¤ÎÇø„e¤Ëév¤ï¤é¤º¡¢
; ¡¡Í¬ÃûÖ¸¶¨¤¹¤ë¤³¤È¤¬³öÀ´¤Þ¤»¤ó¡£
; ¡¡¤½¤Îžé¡¢¤³¤Á¤é¤ÇÈÎÒâ¤Ë×÷³É¤·¤¿¥Þ¥¯¥í¤Ë¤Ï¡¢º†…g¤ËÅÐ„e¤·¤ä¤¹¤¤¤è¤¦¤Ë
; ¡¡¥Þ¥¯¥í¥³©`¥É¡¸mac¡¹¤¬ÏÈî^¤Ë¤¢¤ê¤Þ¤¹¡££¨»ù±¾¥³¥Þ¥ó¥É¤Ï¤¢¤ê¤Þ¤»¤ó¤¬£©
; ¡¡¤´²»±ã¤ò¤ª’ì¤±¤·¤Þ¤¹¤¬¡¢ÊË˜”¤Ê¤Î¤Ç¤ªÔS¤·¤ò¡£





;-------------------------------------------------------------------------------
; ¥æ©`¥¶©`‰äÊý¤Ë¤Ä¤¤¤Æ
;-------------------------------------------------------------------------------
;
;	¥æ©`¥¶©`‰äÊý¤Ï¥·¥Ê¥ê¥ªßMÐÐ¥Õ¥é¥°¡¢ºÃ¸Ð¶È¤Ê¤É¡¢¥·¥Ê¥ê¥ª‚È¤Ç·ÖáªÖÆÓù¤Ê¤É¤ò
;	¤¹¤ëëH¤Ë±ØÒª¤ÊÓ›‘›îIÓò¤Î¤³¤È¤òÖ¸¤·¤Þ¤¹
;
;	¬F×´¤Ç¤Ï¡¢f[0 ¡« SYSTEMÔO¶¨Êý] ¤Þ¤Ç¤ÎÅäÁÐ¤Ç´_±£¤·¤Æ¤¤¤Þ¤¹¡¢
;	ááÊö¤Î¥³¥Þ¥ó¥É¤òÊ¹ÓÃ¤·¤Æ¥·¥Ê¥ê¥ª¥¹¥¯¥ê¥×¥ÈÉÏ¤ËÅäÖÃ¤·¤Æ¤¯¤À¤µ¤¤
;
;	¡ùSYSTEMÔO¶¨Êý¤Ëév¤·¤Æ¤ÏÔO¶¨Õß¤Ë´_ÕJ¤·¤Æ¤¯¤À¤µ¤¤
;
;
;-------------------------------------------------------------------------------
; ¥³¥á¥ó¥È„IÀí¤Ë¤Ä¤¤¤Æ
;-------------------------------------------------------------------------------
;
;	¥¹¥¯¥ê¥×¥ÈÉÏ¤Ç¤Î¥³¥á¥ó¥È„IÀí¤Ï ÐÐ¤ÎÏÈî^¤Ë ;(°ë½Ç¥»¥ß¥³¥í¥ó) ¤òÅäÖÃ¤·¤Æ¤¯¤À¤µ¤¤
;
;	C¡¢C++ÑÔÕZ¤Î /* ¡« */ ¤ä // ¤Ç¤Ï¤¢¤ê¤Þ¤»¤ó¤Î¤Ç¡¢šÝ¤ò¤Ä¤±¤Æ¤¯¤À¤µ¤¤
;
;




;-------------------------------------------------------------------------------
; ÖÆÓùÏµ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ð [if] ( Ìõ¼þ¤Ë¤è¤ê¥·¥Ê¥ê¥ª¤òŒgÐÐ )
;		exp		:ÔuýÌõ¼þÊ½
;				Ìõ¼þÊ½¤Ë¤Ï < > <= >= == != && || ¤ÎÑÝËã×Ó¤¬Ê¹ÓÃ¿ÉÄÜ¤Ç¤¹
;
;	Ê½¤òÔuý¤·¡¢¤½¤Î½Y¹û¤¬ true ( ¤Þ¤¿¤Ï 0 ÒÔÍâ ) ¤Ê¤é¤Ð¡¢
;	elsif9§9else9§9endif ¤Î¤¤¤º¤ì¤«¤Þ¤Ç¤Ë¤¢¤ëÎÄÕÂ¤ä¥¿¥°¤òŒgÐÐ¤·¡¢
;	¤½¤¦¤Ç¤Ê¤¤ˆöºÏ¤ÏŸoÒ•¤·¤Þ¤¹¡£
;	if ¡« endif ¤Îég¤Ë¤Ï¥é¥Ù¥ë¤òÐ®¤Þ¤Ê¤¤¤Ç¤¯¤À¤µ¤¤¡£

;	Àý1 [if exp="false"]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤Ê¤¤
;	[else]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤ë
;	[endif]
;
;	Àý2 [if exp="false"]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤Ê¤¤
;	[elsif exp="false"]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤Ê¤¤
;	[else]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤ë
;	[endif]

;	Àý3
;	[eval exp="f[0] = 10"]
;	
;	[if exp="10 < f[0]"]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤Ê¤¤
;	[elsif exp="0 == f[0]"]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤Ê¤¤
;	[else]
;		¤³¤³¤Ï±íÊ¾¤µ¤ì¤ë
;	[endif]


;-------------------------------------------------------------------------------

;	¡ð [else] ( if ¤ÎÖÐÉí¤¬ŒgÐÐ¤µ¤ì¤Ê¤«¤Ã¤¿¤È¤­¤ËŒgÐÐ )

;	if ¥¿¥°¤â¤·¤¯¤Ï elsif ¥¿¥° ¤È endif ¥¿¥°¤Îég¤ÇÓÃ¤¤¤é¤ì¤Þ¤¹¡£
;	if ¤Þ¤¿¤Ï elsif ¥Ö¥í¥Ã¥¯¤ÎÖÐÉí¤¬¤Ò¤È¤Ä¤âŒgÐÐ¤µ¤ì¤Æ¤¤¤Ê¤¤¤È¤­¡¢
;	else ¤«¤é endif ¤Þ¤Ç¤Îég¤òŒgÐÐ¤·¤Þ¤¹¡£

;-------------------------------------------------------------------------------

;	¡ð [elsif] ( ¤½¤ì¤Þ¤Ç¤Î if ¤ÎÖÐÉí¤¬ŒgÐÐ¤µ¤ì¤Æ¤¤¤Ê¤«¤Ã¤¿¤È¤­¤Ë¡¢Ìõ¼þ¸¶¤­¤ÇŒgÐÐ )
;		exp		:ÔuýÌõ¼þÊ½
;				Ìõ¼þÊ½¤Ë¤Ï < > <= >= == != && || ¤ÎÑÝËã×Ó¤¬Ê¹ÓÃ¿ÉÄÜ¤Ç¤¹

;	if ¥¿¥°¤È endif ¥¿¥°¤Îég¤ÇÓÃ¤¤¤é¤ì¤Þ¤¹¡£
;	¤½¤ì¤Þ¤Ç¤Î if ¥¿¥°¤Þ¤¿¤Ï elsif ¥¿¥°¤ÎÖÐÉí¤¬¤Ò¤È¤Ä¤âŒgÐÐ¤µ¤ì¤Æ¤¤¤Ê¤¤¤È¤­¤Ë
;	Ê½¤òÔuý¤·¡¢¤½¤Î½Y¹û¤¬Õæ¤Ê¤é¤Ð elsif ¤«¤é´Î¤Î elsif9§9else9§9endif ¤Þ¤Ç¤Îég¤òŒgÐÐ¤·¤Þ¤¹
;	¡ùelseif ¤Ç¤Ï¤Ê¤¤¤Î¤Ç×¢Òâ¤·¤Æ¤¯¤À¤µ¤¤
;
;-------------------------------------------------------------------------------

;	¡ð [endif] ( Ìõ¼þ¤Ë¤è¤ê¥·¥Ê¥ê¥ª¤òŒgÐÐ(¤Î½KÁË) )

;	if ¥¿¥°¤Î½KÁË¤òÊ¾¤·¤Þ¤¹
;	
;
;-------------------------------------------------------------------------------

;	¡ð [eval] ( Ê½¤ÎÔuý )

;		exp		:Ôuý¤¹¤ëÊ½¤òÖ¸¶¨¤·¤Þ¤¹¡£ 
;				Ê½¤Ë¤Ï = + - / * += -= ¤ÎÑÝËã×Ó¤¬Ê¹ÓÃ¿ÉÄÜ¤Ç¤¹
;
;	exp ¤ÇÊ¾¤µ¤ì¤¿Ê½¤òÔuý¤·¤Þ¤¹¡£
;	Í¨³£¤Ï‰äÊý¤Ø¤Î‚Ž¤Î´úÈë¤ËÓÃ¤¤¤Þ¤¹¡£

;	Àý:
;	[eval exp="f[0] = 500"]
;	¡ü‰äÊý f[0] ¤ËÊý‚Ž¤ò´úÈë¤·¤Æ¤¤¤ë
;
;	[eval exp="f[0] += 100"]
;	¡ü‰äÊý f[0] ¤Ë100¤ò¼ÓËã¤·¤Æ¤¤¤ë(f[0]¤ÎÖÐ¤Ï600)

;-------------------------------------------------------------------------------

;	¡ðSYSTEM SAVE
;	¡ù¬F×´¤ÎSYSTEM SAVE¥Õ¥é¥°¤ò¥Õ¥¡¥¤¥ë¤Ë•ø¤­³ö¤·¤Þ¤¹

[macro name = macSystemSave]
	[SystemSave]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥¡¥¤¥ë¥Á¥§¥ó¥¸
;	file		: ¥Á¥§¥ó¥¸¤¹¤ë¥Õ¥¡¥¤¥ëÃû
;	¡ù„IÀí¤·¤Æ¤¤¤ë¥¹¥¯¥ê¥×¥È¥·¥Ê¥ê¥ª¥Õ¥¡¥¤¥ë¤ò‰ä¸ü¤·¤Þ¤¹

[macro name = macChange]
	[change file=%file]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥ê¥×¥ì¥¤é_Ê¼¥³¥Þ¥ó¥É
;		ÒýÊý¤Ê¤·
;	¡ù¥ê¥×¥ì¥¤¥·©`¥ó¤Î³õÆÚ»¯„IÀí¤òÐÐ¤¤¤Þ¤¹

[macro name = macReplayStart]
	;//¥ê¥×¥ì¥¤¥â©`¥ÉÒÔÍâ¤ÏËØÍ¨¤ê¤·¤Þ¤¹
	[if exp="MainObj.ReplayFlag == 1"]
		;//¡ùÒÔÏÂ¤Î„IÀí¤Ï¥¿¥¤¥È¥ëš°¤ËÕ{Õû¤·¤Æ˜‹¤¤¤Þ¤»¤ó
		[macWindowView type=0]
		[macTransSet]
		[macBackColor color=0xffffff]
		[macFade time=1000]
		; //£ª¥¦¥§¥¤¥È
		[macWait time=1000]
	[endif]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥ê¥×¥ì¥¤½KÁË¥³¥Þ¥ó¥É
;		ÒýÊý¤Ê¤·
;	¡ù¥ê¥×¥ì¥¤¥·©`¥ó¤ò½KÁË¤·¤Æ¡¢¥ê¥×¥ì¥¤ßx’k»­Ãæ¤Ë‘ø¤ê¤Þ¤¹

[macro name = macReturnReplay]
	;//¥ê¥×¥ì¥¤¥â©`¥ÉÒÔÍâ¤ÏËØÍ¨¤ê¤·¤Þ¤¹
	[if exp="MainObj.ReplayFlag == 1"]
		; //½KÁË„IÀí
		;//¡ùÒÔÏÂ¤Î„IÀí¤Ï¥¿¥¤¥È¥ëš°¤ËÕ{Õû¤·¤Æ˜‹¤¤¤Þ¤»¤ó
		; //£ª¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦·Ç±íÊ¾
		[macWindowView type=0]
		; //¡î¡²¡¡£Â£Ç£Í¡¡¡³Í£Ö¹£¨¥Õ¥§©`¥É£©
		[macPlayBgm file=0 fade=2000]
		; //£ª¥Õ¥§©`¥É¥¢¥¦¥È£¨°×¤Ç•régÖ¸¶¨£©
		[macFadeOut color=0xffffff time=2000]
		; //£ª¥¦¥§¥¤¥È
		[macWait time=1000]
		[ReturnReplay]
	[endif]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¨¥¯¥¹¥È¥é½KÁË¥³¥Þ¥ó¥É
;		ÒýÊý¤Ê¤·
;	¡ù¥¨¥¯¥¹¥È¥é¥·¥Ê¥ê¥ª¤ò½KÁË¤·¤Æ¡¢¥¨¥¯¥¹¥È¥éßx’k»­Ãæ¤Ë‘ø¤ê¤Þ¤¹

[macro name = macReturnExtra]
	[ReturnExtra]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥·¥Ê¥ê¥ª½KÁË¥³¥Þ¥ó¥É
;		ÒýÊý¤Ê¤·
;	¡ùÍ¨³£¥·¥Ê¥ê¥ª¤ò½KÁË¤·¤Æ¡¢¥¿¥¤¥È¥ë»­Ãæ¤Ë‘ø¤ê¤Þ¤¹

[macro name = macRoom]
	[macSystemSave]
	[Room]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¦¥§¥¤¥È
;		time		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»]
;		[skip]		: ¥¯¥ê¥Ã¥¯¤Ç¥¹¥­¥Ã¥×¤µ¤»¤ë (def:1)
;	¡ùŠÖÆµÄ¤Ë¥¦¥§¥¤¥È¤òÈë¤ì¤Þ¤¹
;	¡ù¥Ç¥Õ¥©¥ë¥È¤Ç¤Ï¥¯¥ê¥Ã¥¯¤Ç¥¦¥§¥¤¥È¤ò¥¹¥­¥Ã¥×¤Ç¤­¤Þ¤¹
;	¡ù¥¹¥­¥Ã¥×¤µ¤»¤¿¤¯¤Ê¤¤ˆöºÏ¤Ë¤Ï¡¢skip=0¡¡¤ÈÊôÐÔÖ¸¶¨¤ò¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macWait]
	[hitwait time=%time skip=%skip|1]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¹¥¿¥Ã¥Õ¥í©`¥ëé_Ê¼
;		id	: ±íÊ¾¥­¥ã¥éID(0:ÄÎÄË»¨ 1:¤³¤Î¤ß 2:»¨Àæ 3:ÓêÒô 4:²Ê²Ë)
;
;	¡ù¥¹¥¿¥Ã¥Õ¥í©`¥ë¤òÁ÷¤·¤Þ¤¹
;	¡ù¥¹¥­¥Ã¥×¤ÏÔ“µ±ID¥­¥ã¥é¤Î¥¹¥¿¥Ã¥Õ¥í©`¥ëÍ¨ß^¥Õ¥é¥°¤¬Á¢¤Ã¤Æ¤¤¤ëˆöºÏ¤Î¤ß¿ÉÄÜ¤Ç¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¥¿¥¤¥È¥ëš°¤ËÕ{Õû¤¬±ØÒª¤Ë¤Ê¤ê¤Þ¤¹

[macro name = macStaffRollStart]
	[macWindowView type=0]
	[staffrollstart id=%id|0 ]
	[if exp="f['ENDING_SKIP'] == false"]
	[TransSet]
	[ImageFree layer=-1]
	[ImageFill layer=0 color=0xffffff]
	[macFade time=3000]
	[endif]
	[macPlayBgm]
	[macWait time=1000]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥é¥ó¥À¥à¥³¥Þ¥ó¥É
;		reg			: ½Y¹û¤ò¸ñ¼{¤¹¤ëINDEXÃû
;		top			: ×îÐ¡‚Ž
;		max			: ×î´ó‚Ž
;	¡ù¥é¥ó¥À¥à‚Ž¤ò°kÉú¤µ¤»¡¢¤½¤Î½Y¹û¤ò
;	¡ùÊÜ¤±È¡¤ë¥³¥Þ¥ó¥É¤Ç¤¹
;	¡ùÊÜ¤±È¡¤ì¤ë‚Ž¤Ï ×îÐ¡‚Ž ÒÔÉÏ¡¢×î´ó‚ŽÒÔÏÂ¤Ç¤¹

[macro name = macRandomNumber]
	[randomnumber reg=%reg top=%top max=%max]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥»©`¥Ö¥¿¥¤¥È¥ëÔO¶¨¥³¥Þ¥ó¥É
;		name		: SAVE¥Ç©`¥¿¤Ë¤Ä¤±¤ëÎÄ×Ö
;	¡ù¥»©`¥Ö¥Ç©`¥¿¤Ë¤Ä¤±¤ë¥³¥á¥ó¥ÈÎÄ×Ö¤Ç¤¹
;	¡ùSYSTEM¤Ë¤è¤Ã¤ÆÊ¹ÓÃ¿ÉÄÜ¤«¡¢¤Þ¤¿ÊË˜”¤¬®¤Ê¤ë¤Î¤Ç¡¢
;	¡ù±Ø¤ºÊË˜”¤ò´_ÕJ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macSceneTitle]
	[scenetitle name=%name]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÓÒ¥¯¥ê¥Ã¥¯ÒÖÖÆ
;		flag		: ÓÒ¥¯¥ê¥Ã¥¯ÒÖÖÆ¥Õ¥é¥°(0:½â·Å 1:ÒÖÖÆ)
;	¡ùÓÒ¥¯¥ê¥Ã¥¯ÖÆÓù¤òÒÖÖÆ¤·¤Þ¤¹

[macro name = macRightClickCtrl]
	[rightclickctrl flag=%flag]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦ÏûÈ¥
;		[type]		: ¥¦¥£¥ó¥É¥¦±íÊ¾£º·Ç±íÊ¾(1:±íÊ¾ 0:·Ç±íÊ¾)(def:0)

;	¡ù¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦¤òÒ»•rµÄ¤Ë±íÊ¾¤µ¤»¤¿¤ê¡¢·Ç±íÊ¾¤Ë¤µ¤»¤¿¤ê¤·¤Þ¤¹
;	¡¡Hitret¥³¥Þ¥ó¥É¤Ê¤ÉŠÖÆµÄ¤Ë±íÊ¾¤µ¤ì¤ëˆöºÏ¤â¤¢¤ê¤Þ¤¹

[macro name = macWindowView]
	[windowview type=%type|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¸¥ã¥ó¥×¥Ç©`¥¿¸ñ¼{INDEX‰ä¸ü
;		daystr		: LOG»­Ãæ¤Ë±íÊ¾¤¹¤ëÈÕ¸¶±íÊ¾ÎÄ×Ö(È«½Ç±íÓ›)

;	¡ù¥¸¥ã¥ó¥×¥Ç©`¥¿¤Î¸ñ¼{INDEX¤ò‰ä¸ü¤¹¤ëëH¤ËÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤¡£

[macro name = macChangeJumpIndex]
	[changejumpindex daystr=%daystr]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÈÕ¸¶¥Ü©`¥É±íÊ¾
;		month		: ÔÂ±íÊ¾(0:xx 1 ¡« 12:Êý×Ö 13:Prologue 14:Epilogue)
;		day			: ÈÕ±íÊ¾(0:xx 1 ¡« 31:Êý×Ö)
;		week		: ê×ÈÕ±íÊ¾(0:ÈÕê×ÈÕ ¡« 6:ÍÁê×ÈÕ)

;	¡ùÈÕ¸¶¥Ü©`¥É¤ò±íÊ¾¤·¤Þ¤¹¡£ÈÕ¸¶¥Ü©`¥É¤Î¥ì¥¤¥ä¤Ï [macTransSet] ¤Ç±íÊ¾¤µ¤ì¤ë
;	¡¡¥«©`¥Æ¥óÓÃ¥ì¥¤¥ä¤Ë¤Ïº¬¤Þ¤ì¤Ê¤¤µã¤ËšÝ¤ò¤Ä¤±¤Æ¤¯¤À¤µ¤¤¡£
;	¡ùê×ÈÕ¤Ï»ù±¾µÄ¤ËÖ¸¶¨¤µ¤ì¤¿ÈÕ¸¶¤«¤éSYSTEM‚È¤¬¸î¤ê³ö¤·¤Þ¤¹¡£(2014Äê¤Ç¸î¤ê³ö¤·¤Æ¤Þ¤¹)
;	¡¡¥¹¥¯¥ê¥×¥È‚È¤ÇÖ¸¶¨¤·¤¿¤¤ˆöºÏÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤¡£


[macro name = macSetDayBord]
	[SetDayBord month=%month|0 day=%day|0 week=%week]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÈÕ¸¶¥Ü©`¥ÉÏûÈ¥

;	¡ùÈÕ¸¶¥Ü©`¥É¤òÏûÈ¥¤·¤Þ¤¹¡£
;	¡¡ÈÕ¸¶¥Ü©`¥É¤Ï¤³¤Î¥³¥Þ¥ó¥É¤Ç»ù±¾ÏûÈ¥¤·¤Æ¤¯¤À¤µ¤¤¡£


[macro name = macEraseDayBord]
	[EraseDayBord]
[endmacro]

;-------------------------------------------------------------------------------













;-------------------------------------------------------------------------------
; ßx’kÖ«Ïµ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ðßx’kÖ«±íÊ¾¥ì¥¸¥¹¥¿¤òÏûÈ¥¤¹¤ë
;
;	¡ùßx’kÖ«¤ò±íÊ¾¤¹¤ëëH¤ÎÇ°œÊ‚ä¤ò¤¹¤ë¥³¥Þ¥ó¥É¤Ç¤¹

[macro name = macSelClr]
	[selclr]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðßx’kÖ«¤òÔOÖÃ¤¹¤ë
;	¡ù±íÊ¾¤¹¤ëßx’kÖ«¤òÔOÖÃ¤¹¤ë¥³¥Þ¥ó¥É¤Ç¤¹
;
;		text		: ±íÊ¾¤¹¤ëÎÄ×ÖÁÐ
;		num			: ßx’k½Y¹û¤ÎID·¬ºÅ
;		flag		: ·Çßx’kÅÐ¶¨¤ËÊ¹ÓÃ¤¹¤ë¥Õ¥é¥°·¬ºÅ
;
[macro name = macCmd]
	[cmd text=%text num=%num index=%flag]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðßx’kÖ«¤ò±íÊ¾¤¹¤ë
;	¡ùÔO¶¨¤·¤¿ÄÚÈÝ¤Çßx’kÖ«¤ò±íÊ¾¤¹¤ë¥³¥Þ¥ó¥É¤Ç¤¹
;	¤³¤Î¥³¥Þ¥ó¥ÉÖ¸¶¨¤¹¤ë¤È¡¢ßx’kÖ«¤òßx’k¤¹¤ë¤Þ¤Ç
;	¥¹¥¯¥ê¥×¥È‚È¤ËÖÆÓù¤¬‘ø¤ê¤Þ¤»¤ó
;	ßx’k¤·¤¿ßx’kÖ«¤ÎID·¬ºÅ¤¬ f["selans"] ¤È¤¤¤¦¥ì¥¸¥¹¥¿¤Ë¸ñ¼{¤µ¤ì¤Þ¤¹
;
[macro name = macSelect]
	[Select]
	[SelectEnd]
[endmacro]

;-------------------------------------------------------------------------------
; ¡ðßx’kÖ«ÔOÖÃ¥µ¥ó¥×¥ë
; ¡ùf["selans"] ¤Ë¸ñ¼{¤µ¤ì¤¿‚Ž¤ò if ¥¹¥Æ©`¥È¤òÊ¹ÓÃ¤·¤ÆÅÐ¶¨¤·¤Æ¤¤¤¯ÐÎ¤Ë¤Ê¤ê¤Þ¤¹
;
;[macSelClr]
;	[macCmd num=1 text=ßx’kÖ«£±]
;	[macCmd num=2 text=ßx’kÖ«£²]
;	[macCmd num=3 text=ßx’kÖ«£³]
;	[macCmd num=4 text=ßx’kÖ«£´]
;[macSelect]
; --------------------------------------------------
;  RESPONSE 1-1 ¥³¥Þ¥ó¥É¢Ù
; --------------------------------------------------
;[if exp="f['selans'] == 1"]
;	[Talk name="¥µ¥ó¥×¥ë"]
;		ßx’kÖ«£±¤òßx’k¤·¤Þ¤·¤¿
;	[Hitret]
; --------------------------------------------------
;  RESPONSE 1-2 ¥³¥Þ¥ó¥É¢Ú
; --------------------------------------------------
;[elsif exp="f['selans'] == 2"]
;	[Talk name="¥µ¥ó¥×¥ë"]
;		ßx’kÖ«£²¤òßx’k¤·¤Þ¤·¤¿
;	[Hitret]
; --------------------------------------------------
;  RESPONSE 1-3 ¥³¥Þ¥ó¥É¢Û
; --------------------------------------------------
;[elsif exp="f['selans'] == 3"]
;	[Talk name="¥µ¥ó¥×¥ë"]
;		ßx’kÖ«£³¤òßx’k¤·¤Þ¤·¤¿
;	[Hitret]
; --------------------------------------------------
;  RESPONSE 1-4 ¥³¥Þ¥ó¥É¢Ü
; --------------------------------------------------
;[elsif exp="f['selans'] == 4"]
;	[Talk name="¥µ¥ó¥×¥ë"]
;		ßx’kÖ«£´¤òßx’k¤·¤Þ¤·¤¿
;	[Hitret]
;[endif]

;-------------------------------------------------------------------------------






;-------------------------------------------------------------------------------
; ¥Æ¥­¥¹¥ÈÏµ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ðÃûÇ°„IÀí
;	¡ù¥Í©`¥àîIÓò¤Ë±íÊ¾¤¹¤ëÃûÇ°¤ò¸ñ¼{¤·¤Þ¤¹¡£
;		name		: Ãè»­¤¹¤ë¥­¥ã¥éÃû
;		id			: ±íÊ¾¤¹¤ë¥á¥Ã¥»©`¥¸¥Õ¥ì©`¥à(0:Í¨³£ 1:¥Ò¥í¥¤¥ó)
;		
;		¡ù¥È¥é¥ó¥¸¥·¥ç¥ó¥Õ¥é¥°¤òÒŠ¤Æ¡¢Ãè»­¤¹¤ë¥ª©`¥ÈÃè»­™CÄÜ¤ò×·¼Ó¤·¤Þ¤·¤¿
;
[macro name = Talk]
	;//¥í©`¥ÉÖÐ¤ÏŸoÒ•¤¹¤ë
	[if exp="MainObj.LoadFlag == false"]
		;//¡ö¥ª©`¥ÈÃè»­„IÀí
		;//[setTrans]¥³¥Þ¥ó¥É¤òÊ¹ÓÃ¤·¤¿¥Õ¥é¥°¤¬²Ð¤Ã¤Æ¤¤¤ë¤«£¿
		[if exp="MainObj.EffectObj.SetTransFlag == true"]
			[macFade]
		[endif]
	[endif]
	
	;//¥Õ¥ì©`¥à‰ä¸ü
	[macFrameType id=%id|0]
	
	;//ŒgëH¤Î¥Í©`¥à„IÀí¥³¥Þ¥ó¥É
	[talkwork name=%name]
	
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥á¥Ã¥»©`¥¸Ãè»­„IÀí
;	¡ù[Talk] ¡« [Hitret] ég¤ÎÎÄ×ÖÁÐ¤òÈ¡µÃ¤·¤ÆÃè»­¤·¤Þ¤¹
;
;	Ãè»­¤¹¤ëÎ»ÖÃ¤ä¡¢¿ÉÄÜÎÄ×ÖÊý¡¢ÐÐÊý¤Ê¤É˜”¡©¤ÊÔO¶¨¤Ï userFix.ks ÄÚ¤Ç
;	Ö¸¶¨¤·¤Æ¤ª¤¯±ØÒª¤¬¤¢¤ê¤Þ¤¹
;
[macro name = Hitret]
	[hitretwork]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥©¥ó¥È¥µ¥¤¥º‰ä¸ü„IÀí
;	¡ùÃè»­¤¹¤ëÎÄ×Ö¤Î¥Õ¥©¥ó¥È¥µ¥¤¥º¤òÒ»•rµÄ¤Ë‰ä¸ü¤·¤Þ¤¹
;
;	size		: ‰ä¸ü¤¹¤ë¥Õ¥©¥ó¥È¥µ¥¤¥º
;	[top]		: ‰ä¸üé_Ê¼¹wËù (-1:È«ÎÄ)(def:-1)
;	[num]		: ‰ä¸ü¤¹¤ëÎÄ×ÖÊý (def:0)

[macro name = macFontSize]
	[FontSize size=%size top=%top|-1 num=%num|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥©¥ó¥È¥«¥é©`‰ä¸ü„IÀí
;	¡ùÃè»­¤¹¤ëÎÄ×Ö¤Î¥Õ¥©¥ó¥È¥«¥é©`¤òÒ»•rµÄ¤Ë‰ä¸ü¤·¤Þ¤¹
;
;	color		: ‰ä¸ü¤¹¤ë¥Õ¥©¥ó¥È¥«¥é©`
;	subcolor	: ‰ä¸ü¤¹¤ë¥Õ¥©¥ó¥È¥«¥é©`(´üÎÄ×ÖÉ« or Ó°ÎÄ×ÖÉ«) (-1:Ö¸¶¨É«)(def:-1)
;	[top]		: ‰ä¸üé_Ê¼¹wËù (-1:È«ÎÄ)(def:-1)
;	[num]		: ‰ä¸ü¤¹¤ëÎÄ×ÖÊý (def:0)

[macro name = macFontColor]
	[FontColor color=%color subcolor=%subcolor|-1 top=%top|-1 num=%num|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÃè»­ËÙ¶È‰ä¸ü„IÀí
;	¡ùÃè»­¤¹¤ëÎÄ×ÖWAIT¤òÒ»•rµÄ¤ËŸo¤¯¤·¤Þ¤¹
;
;	[spd]		: ‰ä¸ü¤¹¤ëÃè»­ËÙ¶ÈWAIT(1:max)(def:1)

[macro name = macDrawMessMaxSpd]
	[DrawMessMaxSpd spd=%spd|1]
[endmacro]

;-------------------------------------------------------------------------------











;-------------------------------------------------------------------------------
; »­ÏñÏµ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ð»­ÏñÃè»­„IÀí
;	¡ùÖ¸¶¨¤·¤¿¥ê¥½©`¥¹¤ò»­Ãæ¤Ë±íÊ¾¤·¤Þ¤¹
;
;	file		: ±íÊ¾¤¹¤ë¥ê¥½©`¥¹¥Õ¥¡¥¤¥ëÃû
;	[layer]		: Õ¹é_¤¹¤ë¥ì¥¤¥ä·¬ºÅ(0 ¡« SYSTEMÖ¸¶¨Êý)(def:0)
;	[pos]		: ¹Ì¶¨×ù˜Ë (C R L LC RC LO RO) ¤¬Ö¸¶¨¿ÉÄÜ
;	[x]			: ±íÊ¾¤¹¤ëX×ù˜Ë(def:0)
;	[y]			: ±íÊ¾¤¹¤ëY×ù˜Ë(def:0)
;	[opacity]	: Í¸Ã÷¶È (0 ¡« 255) (def:255)

;	¡ùÖ¸¶¨¿ÉÄÜ¤Ê¥ì¥¤¥ä·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ¤·¤Þ¤¹
;	¡ù±íÊ¾×ù˜Ë¤Ï¥ì¥¤¥äš°¤ËÒý¤­¾@¤®¤ÇÏûÈ¥¥³¥Þ¥ó¥É¤Ç¥¯¥ê¥¢¤µ¤ì¤Þ¤¹
;	¡¡¹Ì¶¨×ù˜Ë¤È…g¶À×ù˜ËÖ¸¶¨¤Ç¤Ï¹Ì¶¨×ù˜Ë¤¬ƒžÏÈ¤Ç¤¹
;	¡¡Á¢¤Á½}¡¢±³¾°¡¢¥¤¥Ù¥ó¥È»­Ïñ¤Ê¤É¤Î·N„e„IÀí¤¬¤¢¤ê¤Þ¤¹¤Î¤Ç¡¢
;	¡¡¤½¤ì¤Ë¤Ä¤¤¤Æ¤ÏSYSTEMÔO¶¨Õß¤Ë´_ÕJ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macImageDraw]
	[ImageDraw file=%file layer=%layer|0 pos=%pos x=%x|0 y=%y|0 opacity=%opacity ]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­ÏñÏûÈ¥„IÀí
;	¡ùÖ¸¶¨¤·¤¿¥ì¥¤¥ä·¬ºÅ¤Î»­Ïñ¤ÈÇéˆó¤òÏ÷³ý¤·¤Þ¤¹
;
;	[layer]		: Ï÷³ý¤¹¤ë¥ì¥¤¥ä·¬ºÅ(-1 ¡« SYSTEMÖ¸¶¨Êý)(-1:È«¥ì¥¤¥ä)(def:0)

;	¡ùÖ¸¶¨¿ÉÄÜ¤Ê¥ì¥¤¥ä·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ¤·¤Þ¤¹

[macro name = macImageFree]
	[ImageFree layer=%layer|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­Ïñ‰T¤ê¤Ä¤Ö¤·„IÀí
;	¡ùÖ¸¶¨¤·¤¿¥ì¥¤¥ä·¬ºÅ¤Î¥ì¥¤¥ä¤òÖ¸¶¨É«¤Ç‰T¤ê¤Ä¤Ö¤·¤Þ¤¹
;
;	[layer]		: „IÀí¤¹¤ë¥ì¥¤¥ä·¬ºÅ(0 ¡« SYSTEMÖ¸¶¨Êý)(def:0)
;	[color]		: Ö¸¶¨É«(16ßMÊý¤ÇÖ¸¶¨)(def:0)
;	¡ùÖ¸¶¨¿ÉÄÜ¤Ê¥ì¥¤¥ä·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ¤·¤Þ¤¹

[macro name = macImageFill]
	[ImageFill layer=%layer|0 color=%color|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­ÏñÒÆ„Ó£¦Í¸ß^¶È‰ä¸ü
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0 max:20)
;		[x]			: ÒÆ„Ó¾àëx£Ø (¬FÔÚÎ»ÖÃ¤«¤é¤ÎÏàŒÖ¸¶¨ or ½~Œ×ù˜Ë) (def:0)
;		[y]			: ÒÆ„Ó¾àëx£Ù (¬FÔÚÎ»ÖÃ¤«¤é¤ÎÏàŒÖ¸¶¨ or ½~Œ×ù˜Ë) (def:0)
;		[time]		: ÒÆ„Ó•rég [ms…gÎ»] (def:1000)
;		[opacity]	: Í¸ß^¶È (Í¸Ã÷0¡«²»Í¸Ã÷255¤Î½~ŒÖ¸¶¨)
;					: Ê¡ÂÔ¤·¤¿ˆöºÏ¤Ï¬FÔÚ¤ÎÍ¸ß^¶È¤Î¤Þ¤Þ¤Ç¤¹
;		[delay]		: ÒÆ„Óé_Ê¼¤Þ¤Ç¤Î´ý¤Á•rég [ms…gÎ»] (def:0)
;		[accel]		: ¼ÓËÙ¶ÈÒÆ„Ó¤¹¤ë¤«¤É¤¦¤« (def:0)
;					¡¡0 ¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤«¤é×îáá¤Þ¤ÇÒ»¶¨¤Î¸îºÏ¤ÇÒÆ„Ó„IÀí¤¬ßMÐÐ¤·¤Þ¤¹
;					¡¡-1 Î´œº¤ÎÊý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏÔç¤¯¡¢Ðì¡©¤ËßW¤¯¤Ê¤ê¤Þ¤¹
;					¡¡1 ¤è¤ê´ó¤­¤¤Êý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏßW¤¯¡¢Ðì¡©¤ËÔç¤¯¤Ê¤ê¤Þ¤¹
;					¡¡´ó¤­¤¤‚Ž¤òÈë¤ì¤Ê¤¤¤È 0 ¤È¤Î²î¤¬ÅÐ¤é¤Ê¤¤¤Î¤Ç¡¢-2¡¢-3 ¤ä 2¡¢3 ¤Ê¤É¤òÍÆŠX¤·¤Þ¤¹
;		[type]		: ×ù˜ËÖ¸¶¨MODE (w:½~Œ×ù˜Ë o:ÏàŒ×ù˜Ë) (def:o)
;
;	¡¡Í¸ß^¶È¤òÖ¸¶¨¤¹¤ë¤³¤È¤Ë¤è¤ê¶Î¡©Ïû¤¨¤Ê¤¬¤é£¨¤½¤ÎÄæ¤â£©ÒÆ„Ó¤µ¤»¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹
;	¡¡Î»ÖÃ¤ò‰ä¤¨¤º¤ËÍ¸ß^¶È¤À¤±¤ò‰ä¤¨¤¿¤¤ˆöºÏ¤Ï¡¢x ¤È y ¤Ë¤Ï 0 ¤òÈë¤ì¤Æ¤¯¤À¤µ¤¤
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢½KÁË¤ò´ý¤¿¤º¤Ë¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹¤¬¡¢
;	¡¡±íÇéÌæ¤¨¤Ê¤É¤ÎCG‰ä¸ü¡¢¥º©`¥à¥³¥Þ¥ó¥É¤Ê¤É¤È¤ÎãÓÃ¤ÏÕ`„Ó×÷¤ÎÔª¤Ç¤¹
;	¡¡±Ø¤º½KÁËáá¤ËËû¤Î¥³¥Þ¥ó¥É¤òŒgÐÐ¤·¤Æ¤¯¤À¤µ¤¤
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢[macWaitMove]ÓÖ¤Ï[macStopMove]¤È¥»¥Ã¥È¤ÇÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤
;	¡¡½KÁË¤ò´ý¤Á¤¿¤¤ˆöºÏ¤Ï¡¢[macWaitMove]¤òÈÎÒâ¤ÎˆöËù¤ËÈë¤ì¤Æ¤¯¤À¤µ¤¤
;	¡¡ÒÆ„ÓÍ¾ÖÐ¤ÇŠÖÆ½KÁË¤·¤¿¤¤ˆöºÏ¤Ï¡¢[macStopMove]¤òÈÎÒâ¤ÎˆöËù¤ËÈë¤ì¤Æ¤¯¤À¤µ¤¤
;
[macro name = macImageMove]
	[imagemove layer=%layer|0 x=%x|0 y=%y|0 opacity=%opacity time=%time|1000 delay=%delay|0 accel=%accel|0 type=%type|o]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­ÏñÒÆ„Ó¥¹¥×¥é¥¤¥óÒÆ„Ó£¦Í¸ß^¶È‰ä¸ü
;		path		: ÒÆ„Ó¾àëx×ù˜Ë (½~Œ×ù˜Ë)
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ  (def:0 max:20)
;		[time]		: Ö§µã¤«¤éÖ§µã¤Þ¤Ç¤ÎÒÆ„Ó•rég [ms…gÎ»] (def:300)
;					¡¡TOTALTIME¤ÏÖ§µã¡Átime¤È¤Ê¤ê¤Þ¤¹
;		[delay]		: ÒÆ„Óé_Ê¼¤Þ¤Ç¤Î´ý¤Á•rég [ms…gÎ»] (def:0)
;		[accel]		: ¼ÓËÙ¶ÈÒÆ„Ó¤¹¤ë¤«¤É¤¦¤« (def:0)
;					¡¡0 ¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤«¤é×îáá¤Þ¤ÇÒ»¶¨¤Î¸îºÏ¤ÇÒÆ„Ó„IÀí¤¬ßMÐÐ¤·¤Þ¤¹
;					¡¡-1 Î´œº¤ÎÊý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏÔç¤¯¡¢Ðì¡©¤ËßW¤¯¤Ê¤ê¤Þ¤¹
;					¡¡1 ¤è¤ê´ó¤­¤¤Êý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏßW¤¯¡¢Ðì¡©¤ËÔç¤¯¤Ê¤ê¤Þ¤¹
;					¡¡´ó¤­¤¤‚Ž¤òÈë¤ì¤Ê¤¤¤È 0 ¤È¤Î²î¤¬ÅÐ¤é¤Ê¤¤¤Î¤Ç¡¢-2¡¢-3 ¤ä 2¡¢3 ¤Ê¤É¤òÍÆŠX¤·¤Þ¤¹
;
;	¡¡Í¸ß^¶È¤òÖ¸¶¨¤¹¤ë¤³¤È¤Ë¤è¤ê¶Î¡©Ïû¤¨¤Ê¤¬¤é£¨¤½¤ÎÄæ¤â£©ÒÆ„Ó¤µ¤»¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢½KÁË¤ò´ý¤¿¤º¤Ë¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹¤¬¡¢
;	¡¡±íÇéÌæ¤¨¤Ê¤É¤ÎCG‰ä¸ü¡¢¥º©`¥à¥³¥Þ¥ó¥É¤Ê¤É¤È¤ÎãÓÃ¤ÏÕ`„Ó×÷¤ÎÔª¤Ç¤¹
;	¡¡±Ø¤º½KÁËáá¤ËËû¤Î¥³¥Þ¥ó¥É¤òŒgÐÐ¤·¤Æ¤¯¤À¤µ¤¤
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢[macWaitMove]ÓÖ¤Ï[macStopMove]¤È¥»¥Ã¥È¤ÇÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤
;	¡¡½KÁË¤ò´ý¤Á¤¿¤¤ˆöºÏ¤Ï¡¢[macWaitMove]¤òÈÎÒâ¤ÎˆöËù¤ËÈë¤ì¤Æ¤¯¤À¤µ¤¤
;	¡¡ÒÆ„ÓÍ¾ÖÐ¤ÇŠÖÆ½KÁË¤·¤¿¤¤ˆöºÏ¤Ï¡¢[macStopMove]¤òÈÎÒâ¤ÎˆöËù¤ËÈë¤ì¤Æ¤¯¤À¤µ¤¤
;
;	¡ù×ù˜ËÖ¸¶¨
;	ÒÆ„ÓÎ»ÖÃ¤òÖ¸¶¨¤·¤Þ¤¹¡£
;	ÒÆ„ÓÎ»ÖÃ¤Ï¡¢x(¥ì¥¤¥ä×ó¶ËÎ»ÖÃ), y(¥ì¥¤¥äÉÏ¶ËÎ»ÖÃ), opacity(¥ì¥¤¥äâ¶È) ¤ò£³¤Ä¤Å¤Ä¡¢¥«¥ó¥Þ¤ä¿Õ°×¡¢( ) ¤ÇÇøÇÐ¤Ã¤ÆÖ¸¶¨¤·¤Þ¤¹¡£
;	¤³¤ì¤é¤Îég¤ò¡¢¥¹¥×¥é¥¤¥óÑaég¤Þ¤¿¤ÏÖ±¾€Ñaég¤Ë¤Æ¥ì¥¤¥ä¤¬ÒÆ„Ó¤·¤Þ¤¹¡£
;	opacity ¤Ë¤Ï¥ì¥¤¥ä¤Î±íÊ¾â¶È¤òÖ¸¶¨¤·¤Þ¤¹¡£¥ì¥¤¥ä¤Îâ¶È¤âµã¤«¤éµã¤òÒÆ„Ó¤¹¤ëég¤ËßB¾AµÄ¤Ë‰ä»¯¤·¤Þ¤¹¡£
;
;	Àý£º[macImageSpMove layer=1 time=500 path="(320,240,0) (320,240,511) (320,240,0) (320, 240,0)"]
;
[macro name = macImageSpMove]
	[imagespmove layer=%layer|0 path=%path time=%time|300 delay=%delay|0 accel=%accel|0 functype=1]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÒÆ„Ó£¦Í¸ß^¶ÈÑÝ³ö¤ò´ý¤Ä
;		[skip]		: ¥¯¥ê¥Ã¥¯¤Ç¥¹¥­¥Ã¥×¤µ¤»¤ë (def:1)
;	¡ù[macImageMove]ÓÖ¤Ï[macImageShake]Ïµ¥³¥Þ¥ó¥É¤Ç„Ó×÷ÖÐ¤ÎÑÝ³ö¤Î½KÁË¤ò´ý¤Á¤Þ¤¹

[macro name = macWaitMove]
	[WaitMove skip=%skip|1]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÒÆ„Ó£¦Í¸ß^¶ÈÑÝ³ö¤òŠÖÆ½KÁË¤¹¤ë
;	¡ù[macImageMove]¥³¥Þ¥ó¥É¤Ç„Ó×÷ÖÐ¤ÎÑÝ³ö¤òŠÖÆ½KÁË¤µ¤»¤Þ¤¹

[macro name = macStopMove]
	[StopMove]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­Ïñ¥ì¥¤¥ä¤ÎZOOM„IÀí
;
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0)
;		dl			: ×î½K¾ØÐÎ¤Î×ó¶ËÎ»ÖÃ
;		dt			: ×î½K¾ØÐÎ¤ÎÉÏ¶ËÎ»ÖÃ
;		[rate]		: ’ˆ¿sÂÊ(%Ö¸¶¨) (def:100)
;		[time]		: ¥º©`¥à•rég [ms…gÎ»] (def:0)
;		[accel]		: ¼ÓËÙ¶ÈÒÆ„Ó¤¹¤ë¤«¤É¤¦¤« (def:0)
;					¡¡0 ¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤«¤é×îáá¤Þ¤ÇÒ»¶¨¤Î¸îºÏ¤ÇÒÆ„Ó„IÀí¤¬ßMÐÐ¤·¤Þ¤¹
;					¡¡-1 Î´œº¤ÎÊý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏÔç¤¯¡¢Ðì¡©¤ËßW¤¯¤Ê¤ê¤Þ¤¹
;					¡¡1 ¤è¤ê´ó¤­¤¤Êý¤òÖ¸¶¨¤¹¤ë¤È¡¢×î³õ¤ÏßW¤¯¡¢Ðì¡©¤ËÔç¤¯¤Ê¤ê¤Þ¤¹
;					¡¡´ó¤­¤¤‚Ž¤òÈë¤ì¤Ê¤¤¤È 0 ¤È¤Î²î¤¬ÅÐ¤é¤Ê¤¤¤Î¤Ç¡¢-2¡¢-3 ¤ä 2¡¢3 ¤Ê¤É¤òÍÆŠX¤·¤Þ¤¹
;					¡ù¥³¥Þ¥ó¥É¤ÎÊË˜”ÉÏ¥¢¥Ë¥á©`¥·¥ç¥ó¤ÈÍ¬•r¤ËŒgÐÐ¤¹¤ë¤³¤È¤Ï¤Ç¤­¤Þ¤»¤ó¡£
;		[type]		: ’ˆ´ó¿sÐ¡¤Î¥¿¥¤¥×¤òÖ¸¶¨¤·¤Þ¤¹ (def:1)
;					¡ù¥¿¥¤¥×ÕhÃ÷£º
;					0 : ×î½ü°øµã·¨¤¬ÓÃ¤¤¤é¤ì¤Þ¤¹
;					1 : µÍ¾«¶È¤Î¾€ÐÎÑaég¤¬ÓÃ¤¤¤é¤ì¤Þ¤¹
;					2 : ¾€ÐÎÑaég¤¬ÓÃ¤¤¤é¤ì¤Þ¤¹
;					ËÙ¶È¤Ï 0 > 1 > 2 ¤Îí˜¤Ë¸ßËÙ¤Ç¤¹¤¬¡¢»­Ù|¤ÏËÙ¶È¤¬
;					ËÙ¤±¤ì¤ÐËÙ¤¤¥¿¥¤¥×¤Û¤ÉµÍ»­Ù|¤Ë¤Ê¤ê¤Þ¤¹¡£
;		[image]		: »­Ïñ¥ê¥½©`¥¹¤òÔÙ¶ÈÕi¤ßÞz¤ó¤ÇÊ¹ÓÃ¤¹¤ë¤«
;					 (0:ÔÙÕiÞz 1:¥ì¥¤¥ä¤Î»­Ïñ¤ò¤½¤Î¤Þ¤ÞÊ¹ÓÃ)(def:0)

[macro name = macImageZoom]
	[imagezoom layer=%layer|0 dl=%dl dt=%dt rate=%rate|100 time=%time|0 accel=%accel|0 type=%type|1 image=%image|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥°¥é¥Õ¥£¥Ã¥¯¤Î¥¬¥ó¥ÞÑaÕý„IÀí
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0)
;		[gray]		: ¥°¥ì©`¥¹¥±©`¥ë¤Ë¤¹¤ë¤«£¿ (def:0)
;		[r]			: ³à¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;		[g]			: ¾v¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;		[b]			: Çà¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;		
;		ZOOMáá¤Î»­Ïñ¤Ê¤É¤Ë¥¬¥ó¥Þ„IÀí¤òÊ¹ÓÃ¤¹¤ëˆöºÏ¤ËÊ¹ÓÃ¤·¤Þ¤¹¡£
;		ZOOM„IÀíÍêÁËáá¤ËÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤¡£ZOOM„IÀíÖÐ¤ËÊ¹ÓÃ¤¹¤ë¤³¤È¤Ï¤Ç¤­¤Þ¤»¤ó
;		
;		¡ù¤¿¤È¤¨¤Ð»­Ïñ¤ò¥»¥Ô¥¢Õ{¤Ë¤¹¤ë¤Ë¤Ï¡¢gray=1 r=1.4 g=1.2 b=0.8 ¤ÈÖ¸¶¨¤·¤Þ¤¹
;		ÌåòY°æ¤Ç¤Ï¥¬¥ó¥ÞÑaÕý¤Ç¤´¤Þ¤«¤¹¤«¤â¡¡Ò¹¡¡r=0.6 g=0.8 b=0.8¡¡Ï¦·½¡¡r=1.1 g=0.8 b=0.8

[macro name = macGammaImage]
	[imagegamma layer=%layer|0 gray=%gray|0 rgamma=%r|1.0 ggamma=%g|1.0 bgamma=%b|1.0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¬¥ó¥ÞÑaÕý¤·¤Ê¤¬¤é¥°¥é¥Õ¥£¥Ã¥¯¥Õ¥¡¥¤¥ë¤Î±íÊ¾
;		file		: ¥Õ¥¡¥¤¥ëÃû
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0)
;		[pos]		: Î»ÖÃ£É£Ä [left_out(lo)/left(l)/left_center(lc)/center(c)/right_center(rc)/right(r)/right_out(ro)] (def:0)
;		[x]			: £Ø×ù˜Ë (def:0)
;		[y]			: £Ù×ù˜Ë (def:0)
;		[opacity]	: Í¸ß^¶È (def:255)
;		[gray]		: ¥°¥ì©`¥¹¥±©`¥ë¤Ë¤¹¤ë¤«£¿ (def:0)
;		[r]			: ³à¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;		[g]			: ¾v¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;		[b]			: Çà¤Î¥¬¥ó¥ÞÑaÕý‚Ž (0.1 ¡« 1.0(def) ¡« 9.9)
;	¡ù×ù˜ËÏµÊôÐÔ¤òÈ«¤ÆÊ¡ÂÔ¤·¤¿ˆöºÏ¡¢½~Œ×ù˜Ë(0, 0)¤Ë¤Ê¤ê¤Þ¤¹
;	¡ù¤¹¤Ç¤Ë±íÊ¾œg¤ß¤ÎˆöºÏ¤Ï×ù˜Ë¤Ï‰ä¸ü¤µ¤ì¤Þ¤»¤ó£¨±íÇé‰ä¤¨µÈ£©
;	¡ù¤¿¤È¤¨¤Ð»­Ïñ¤ò¥»¥Ô¥¢Õ{¤Ë¤¹¤ë¤Ë¤Ï¡¢gray=1 r=1.4 g=1.2 b=0.8 ¤ÈÖ¸¶¨¤·¤Þ¤¹
;	¡ùÀý¡¡Ò¹¡¡r=0.6 g=0.8 b=0.8¡¡Ï¦·½¡¡r=1.1 g=0.8 b=0.8

[macro name = macGammaImageDraw]
	[imagedraw file=%file layer=%layer|0 pos=%pos x=%x y=%y opacity=%opacity|255]
	[imagegamma layer=%layer|0 gray=%gray|0 rgamma=%r|1.0 ggamma=%g|1.0 bgamma=%b|1.0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥°¥é¥Õ¥£¥Ã¥¯¤ÎÃ÷¶È9§9¥³¥ó¥È¥é¥¹¥È„IÀí
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0)
;		[light]		: Ã÷¶ÈÕ{Õû‚Ž (def:0)
;		[contrast]	: ¥³¥ó¥È¥é¥¹¥È‚Ž (def:0)
;		
;		ZOOMáá¤Î»­Ïñ¤Ê¤É¤ËÃ÷¶È9§9¥³¥ó¥È¥é¥¹¥È„IÀí¤òÊ¹ÓÃ¤¹¤ëˆöºÏ¤ËÊ¹ÓÃ¤·¤Þ¤¹¡£
;		ZOOM„IÀíÍêÁËáá¤ËÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤¡£ZOOM„IÀíÖÐ¤ËÊ¹ÓÃ¤¹¤ë¤³¤È¤Ï¤Ç¤­¤Þ¤»¤ó
;		
;		* Ã÷¶È¤È¥³¥ó¥È¥é¥¹¥È
;			Ã÷¶È -255 ¡« 255, Ø“Êý¤ÎˆöºÏ¤Ï°µ¤¯¤Ê¤ë
;			¥³¥ó¥È¥é¥¹¥È -100 ¡«100, 0 ¤ÎˆöºÏ‰ä»¯¤·¤Ê¤¤

[macro name = macLightImage]
	[imagelight layer=%layer|0 light=%light|0 contrast=%contrast|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÁ¢¤Á½}•régÖ¸¶¨¥³¥Þ¥ó¥É
;		[timeid]	: ±íÊ¾¤¹¤ëÁ¢¤Á½}¤Î•régŽ¡Ö¸¶¨(def:0)
;					[0:Í¨³£ 1:Ï¦·½ 2:Ò¹£± 3:Ò¹£² 4:Ò¹£³]
;		
;		¡ù±íÊ¾¤¹¤ëÁ¢¤Á½}ËØ²Ä¤Î•régŽ¡¤òÔO¶¨¤·¤Þ¤¹¡£
;		¡¡¤³¤Î¥³¥Þ¥ó¥É¤Ï¾@¾A¥¿¥¤¥×¤Ç¤¹
;		¡¡¥·¥Ê¥ê¥ª¤ÎÏÈî^¤ÇÊ¹ÓÃ¤¹¤ë¤È¤½¤³ÒÔ½µ¤«¤éÁ¢¤Á½}¤Î»­Ïñ¤Ë
;		¡¡¹Ì¶¨¥¬¥ó¥Þ„IÀí¤¬Ê©¤µ¤ì¤Þ¤¹
;		¡ù¹Ì¶¨¥¬¥ó¥Þ„IÀí¤ÎÔO¶¨‚Ž¤Ï„e¥Õ¥¡¥¤¥ë¤ÇÔO¶¨¤µ¤ì¤Æ¤¤¤Þ¤¹¤Î¤Ç¡¢
;		¡¡SYSTEMÔO¶¨Õß¤Ë´_ÕJ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macSetBustUpTime]
	;´úÈë„IÀí
	[Substitution index="BuTimeSelect" val=%timeid|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÁ¢¤Á½}Ãè»­ßWÑÓ„IÀí¥³¥Þ¥ó¥É
;		file	: ¥á¥¤¥ó¥ì¥¤¥ä±íÊ¾¤¹¤ë»­Ïñ¥Õ¥¡¥¤¥ë
;		file2	: ¥Æ¥ó¥Ý¥é¥ê¤Ë±íÊ¾¤¹¤ë»­Ïñ¥Õ¥¡¥¤¥ë
;		[layer]	: ¥ì¥¤¥ä·¬ºÅ(def:0)
;		[x]		: x×ù˜ËÔO¶¨(def:0)
;		[y]		: y×ù˜ËÔO¶¨(def:0)
;		[pos]	: »ùœÊ×ù˜ËÔO¶¨
;		[time]	: ¥Æ¥ó¥Ý¥é¥ê¥ì¥¤¥ä¤È¥á¥¤¥ó¥ì¥¤¥ä¤ÎÇÐ¤êÌæ¤¨é_Ê¼•rég(def:1000)
;		[fade]	: ÜžËÍ·½·¨(1:Fade 0:…g¼ƒÜžËÍ)(def:1)
;		[drawtype]	: ÇÐ¤êÌæ¤¨·½·¨ (1:I¥ì¥¤¥ä¤ò‰ä¸ü 0:¥Æ¥ó¥Ý¥é¥ê¤Î¤ß‰ä¸ü)(def:0)
;		
;		¡ù×ù˜Ë¤Ïpos¤¬ƒžÏÈ¤Ç¤¹¡£
;		
;		¡ù»­Ïñ¤ò±íÊ¾¤·¤¿áá¡¢ÔO¶¨•régáá¤Ë¥Æ¥ó¥Ý¥é¥ê»­Ïñ¤ÈÇÐ¤êÌæ¤¨„IÀí¤¬Ê¼¤Þ¤ê¤Þ¤¹¡£
;		¡¡ÔO¶¨•rég¤Ç±íÊ¾¤¬ÇÐ¤êÌæ¤ï¤ë¤ï¤±¤Ç¤Ï¤Ê¤¤¤Î¤Ë×¢Òâ¤·¤Æ¤¯¤À¤µ¤¤
;		
;		drawtype£ºËØÌå¤ò‰ä¸ü¤·¤¿¤¤ˆöºÏ¤Ï¡¢¡¸I¥ì¥¤¥ä¤ò‰ä¸ü¤¹¤ë¡¹¤òßx’k¤·¤Æ¤¯¤À¤µ¤¤¡£
;				¡¡±íÇéÌæ¤¨¤ÎˆöºÏ¤Ï¡¸¥Æ¥ó¥Ý¥é¥ê¤Î¤ß‰ä¸ü¡¹¤ò‰ä¸ü¤·¤¿·½¤¬Á¼¤¤¸Ð¤¸¤¬¤·¤Þ¤·¤¿
;		
;		

[macro name = macImageDelayDraw]
	;//ßWÑÓÃè»­
	[imagedraw file=%file file2=%file2 layer=%layer|0 pos=%pos x=%x y=%y time=%time|1000 fade=%fade|1 drawtype=%drawtype|0 zoom=%zoom|1 def=0]
	[macFaceDelayDraw file1=%file file2=%file2 time=%time|1000 fade=%fade|1 delaytype=%drawtype|0 ]
[endmacro]

;-------------------------------------------------------------------------------







;-------------------------------------------------------------------------------
; ¥Õ¥§¥¤¥¹Ïµ¥³¥Þ¥ó¥É
;
; ¡ùÒÔÏÂ¥Õ¥§¥¤¥¹Ïµ¥³¥Þ¥ó¥É¤Ï userFix.ks ¤Î nFACE_FLAGÖ¸¶¨×Ó ¤¬ true ÔO¶¨¤ÎˆöºÏ¤Î¤ß
;¡¡Ê¹ÓÃ¿ÉÄÜ¤Ç¤¹
;
; ¡ù¥Õ¥§¥¤¥¹»­Ïñ¤Ë¤Ä¤¤¤Æ
;
; ¥Õ¥§¥¤¥¹»­Ïñ¤Ï»ù±¾µÄ¤ËÊ¹ÓÃ¤µ¤ì¤Æ¤¤¤ëÁ¢¤Á½}ËØ²Ä¤«¤éÖ¸¶¨¾ØÐÎ¤ò¥³¥Ô©`¤·¤Æ
; Ê¹ÓÃ¤·¤Æ¤¤¤Þ¤¹(¾ØÐÎ¤ÎÖ¸¶¨¤Ï„e¥Õ¥¡¥¤¥ë¤Ç¤¹)
;
;-------------------------------------------------------------------------------

;	¡ð¥Õ¥§¥¤¥¹Ãè»­¥³¥Þ¥ó¥É
;		[file]	: »­Ïñ¥Õ¥¡¥¤¥ëÃû
;		[type]	: ¥³¥Þ¥ó¥É³Ö¾ATYPE(0:1hitret 1:ÔÙÖ¸¶¨¤Þ¤Ç)(def:0)
;		[force]	: ŠÖÆÃè»­¥Õ¥é¥°(0:Í¨³£ 1:ŠÖÆ)(def:0) ·Ç±íÊ¾ÔO¶¨Ãû¤Ç¤â±íÊ¾¤¹¤ëˆöºÏ¤ËÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤
;		
;		[gray]		: ¥°¥ì¥¤¥Õ¥é¥°
;		[rg]		: ³à¥¬¥ó¥Þ‚Ž
;		[gg]		: ¾v¥¬¥ó¥Þ‚Ž
;		[bg]		: Çà¥¬¥ó¥Þ‚Ž
;		[light]		: Ã÷¶È‚Ž
;		[contrast]	: ¥³¥ó¥È¥é¥¹¥È‚Ž
;		[opacity]	: Í¸Ã÷¶È
;		
;	¡ùÖ¸¶¨¤µ¤ì¤¿»­Ïñ¤ò¥­¥ã¥éÃû¡¢±íÊ¾¤µ¤ì¤Æ¤¤¤ëÁ¢¤Á½}¡¢±íÇé¤Ëév¤ï¤é¤º±íÊ¾¤·¤Þ¤¹
;	¡¡type 1 ¤ò½â³ý¤¹¤ëˆöºÏ¤Ï¥Õ¥¡¥¤¥ëÃû¤òÖ¸¶¨¤»¤º¤Ë¥³¥Þ¥ó¥É¤òÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤¡£
;	
[macro name = macFaceDraw]
	[facehidden type=2]
	[facedraw file=%file type=%type|0 force=%force|0 gray=%gray rg=%rg gg=%gg bg=%bg light=%light contrast=%contrast opacity=%opacity]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥§¥¤¥¹ÒÖÖÆ¥³¥Þ¥ó¥É
;		[type]	: ¥³¥Þ¥ó¥É³Ö¾ATYPE(0:1hitret 1:ÔÙÖ¸¶¨¤Þ¤Ç 2:½â³ý)(def:0)
;
;	¡ù¥Õ¥§¥¤¥¹Ãè»­¤òÒÖÖÆ¤·¤Þ¤¹
;	¡¡[macFaceDraw] ¥³¥Þ¥ó¥É¤ÈÏàŒ¤¹¤ë¥³¥Þ¥ó¥É¤Ç¤¹¡£
;	¡¡[macFaceDraw] ¤È [macFaceHidden] ¤Ç¤Ï×îáá¤Ëºô¤Ð¤ì¤¿¥³¥Þ¥ó¥É¤¬ƒžÏÈ¤µ¤ì¤Þ¤¹
;	¡¡¤Þ¤¿¡¢¤½¤ì¤¾¤ì¤Î¥³¥Þ¥ó¥ÉÄÚ²¿¤ÇÏàŒ¤¹¤ë¥³¥Þ¥ó¥ÉÇéˆó¤Ï¥¯¥ê¥¢¤µ¤ì¤Þ¤¹¤Î¤Ç¡¢
;	¡¡×¢Òâ¤·¤Æ¤¯¤À¤µ¤¤
;
;Àý£º
;
;	[macFaceDraw file=*** type=1] ¡ù¾@¾AÃè»­
;
;	[Talk name=£ª£ª]
;	¥Æ¥¹¥È
;	[Hitret]
;
;	[macFaceHidden] ¡ùÃè»­ÒÖÖÆ(1hitret) ¤³¤³¤Ç¾@¾AÃè»­¤Ï¥¯¥ê¥¢¤µ¤ì¤Þ¤¹
;
;	[Talk name=£ª£ª]
;	¥Æ¥¹¥È£²
;	[Hitret]
;	
;	[Talk name=£ª£ª] ¡ùÍ¨³£¥Õ¥§¥¤¥¹„IÀí¤Ë¤Ê¤ê¤Þ¤¹
;	¥Æ¥¹¥È£³
;	[Hitret]
;

[macro name = macFaceHidden]
	[facedraw]
	[facehidden type=%type|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥§¥¤¥¹ßWÑÓÃè»­¥³¥Þ¥ó¥É
;		[file1]		: »­Ïñ¥Õ¥¡¥¤¥ëÃû
;		[file2]		: »­Ïñ¥Õ¥¡¥¤¥ëÃû
;		[time]		: ¥Æ¥ó¥Ý¥é¥ê¥ì¥¤¥ä¤È¥á¥¤¥ó¥ì¥¤¥ä¤ÎÇÐ¤êÌæ¤¨é_Ê¼•rég(def:1000)
;		[fade]		: ÜžËÍ·½·¨(1:Fade 0:…g¼ƒÜžËÍ)(def:1)
;		[delaytype]	: ÇÐ¤êÌæ¤¨·½·¨ (0:¥Æ¥ó¥Ý¥é¥ê¤Î¤ß‰ä¸ü 1:I¥ì¥¤¥ä¤ò‰ä¸ü)(def:0)
;		[force]	: ŠÖÆÃè»­¥Õ¥é¥°(0:Í¨³£ 1:ŠÖÆ)(def:0) ·Ç±íÊ¾ÔO¶¨Ãû¤Ç¤â±íÊ¾¤¹¤ëˆöºÏ¤ËÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤
;		
;	¡ùÖ¸¶¨¤µ¤ì¤¿»­Ïñ¤ò¥­¥ã¥éÃû¡¢±íÊ¾¤µ¤ì¤Æ¤¤¤ëÁ¢¤Á½}¡¢±íÇé¤Ëév¤ï¤é¤º
;	¡¡ßWÑÓ±íÊ¾¤·¤Þ¤¹

[macro name = macFaceDelayDraw]
	[facehidden type=2]
	[facedraw file=%file1 file2=%file2 time=%time|1000 fade=%fade|1 delaytype=%delaytype|0 force=%force|0]
[endmacro]

;-------------------------------------------------------------------------------


;-------------------------------------------------------------------------------
; ¥á¥Ã¥»©`¥¸¥Õ¥ì©`¥à‰ä¸ü ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------
;
; ¡ð¥Õ¥ì©`¥à‰ä¸ü¥³¥Þ¥ó¥É
;	[id]		: 0£¨Í¨³££©1£¨¥Ò¥í¥¤¥óÒ•µã£©£¨def:0£©
;
;	¡ù±íÊ¾¤¹¤ë¥á¥Ã¥»©`¥¸¥Õ¥ì©`¥àËØ²Ä¤òÔO¶¨¤·¤Þ¤¹¡£
;	¡¡¤³¤Î¥³¥Þ¥ó¥É¤Ï¾@¾A¥¿¥¤¥×¤Ç¤¹
;
[macro name = macFrameType]
	;´úÈë„IÀí
	[Substitution index="MessFrameType" val=%id|0]
	[FrameType]
[endmacro]

;-------------------------------------------------------------------------------









;-------------------------------------------------------------------------------
; ¥µ¥¦¥ó¥ÉÏµ¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ð£Â£Ç£Í¤ÎÖÆÓù
;		file		: ¥Õ¥¡¥¤¥ëÃû£¯ 0 ¤ÇÍ£Ö¹(def:0)
;		[fade]		: ¥Õ¥§©`¥É•rég [ms…gÎ»] (def:0)
;		[pan]		: LRÔO¶¨(def:0) -100 ¡« 0 ¡« 100 ¤ÇÔO¶¨¤·¤Æ¤¯¤À¤µ¤¤
;
[macro name = macPlayBgm]
	[playbgm file=%file|0 fade=%fade|0 pan=%pan|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð„¿¹ûÒô¤ÎÖÆÓù
;		file		: ¥Õ¥¡¥¤¥ëÃû£¯£°¤ÇÍ£Ö¹
;		[id]		: ¥ì¥¤¥ä·¬ºÅ(Ê¹ÓÃ¿ÉÄÜ¤Ê·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ) [def:0]
;		[loop]		: loopÔÙÉú (def:0)
;		[pan]		: LRÔO¶¨(def:0) -100 ¡« 0 ¡« 100 ¤ÇÔO¶¨¤·¤Æ¤¯¤À¤µ¤¤
;		[delay]		: DELAY TIME(def:0)
;		[fade]		: ¥Õ¥§©`¥É•rég [ms…gÎ»] (def:0)
;
[macro name = macPlaySe]
	[playse file=%file|0 id=%id|0 loop=%loop|0 pan=%pan|0 delaytime=%delay|0 fade=%fade|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð„¿¹ûÒô´ý™C
;	¡ù„¿¹ûÒô¤¬½KÁË¤¹¤ë¤Þ¤Ç´ý™C¤·¤Þ¤¹
;	…g¶ÀÔÙÉú„¿¹ûÒô¤Ê¤É¤Î´ý™C¤ò¤·¤¿¤¤ˆöºÏ¤Ê¤É¤ËÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤
;
;		[id]		: ID·¬ºÅ [def:0]
;
[macro name = macSeWait]
	[SeWait id=%id|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÒôÉù¤ÎÔÙÉú
;		file		: ¥Õ¥¡¥¤¥ëÃû
;		[id]		: ¥ì¥¤¥ä·¬ºÅ(Ê¹ÓÃ¿ÉÄÜ¤Ê·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ) (def:0)
;		[pan]		: LRÔO¶¨(def:0) -100 ¡« 0 ¡« 100 ¤ÇÔO¶¨¤·¤Æ¤¯¤À¤µ¤¤
;		[play]		: ÔÙÉúÖÆÓù 1:¼´ÔÙÉú 0:¥á¥Ã¥»©`¥¸Ãè»­•rÔÙÉú (def:0)
;
[macro name = macPlayVoice]
	[voice file=%file id=%id|0 pan=%pan|0 play=%play|0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÒôÉùÍ£Ö¹
;	¡ùŠÖÆµÄ¤ËÒôÉù¤òÍ£Ö¹¤·¤Þ¤¹
;	…g¶ÀÔÙÉúÒôÉù¤Ê¤É¤òÍ£Ö¹¤·¤¿¤¤ˆöºÏ¤Ê¤É¤ËÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤
;
;		[id]		: ¥ì¥¤¥ä·¬ºÅ(Ê¹ÓÃ¿ÉÄÜ¤Ê·¬ºÅ¤ÏSYSTEMÔO¶¨¤ËÒÀ´æ) [def:-1(È«Í£Ö¹)]
;
[macro name = macStopVoice]
	[voicestop id=%id|-1]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ðÒôÉù´ý™C
;	¡ùÒôÉù¤¬½KÁË¤¹¤ë¤Þ¤Ç´ý™C¤·¤Þ¤¹
;	…g¶ÀÔÙÉúÒôÉù¤Ê¤É¤Î´ý™C¤ò¤·¤¿¤¤ˆöºÏ¤Ê¤É¤ËÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤
;
;		[id]		: ID·¬ºÅ [def:0]
;
[macro name = macVoiceWait]
	[voicewait id=%id|0]
[endmacro]

;-------------------------------------------------------------------------------






;-------------------------------------------------------------------------------
;
; ¥à©`¥Ó©`ÔÙÉú
;
;-------------------------------------------------------------------------------

;	¡ð¥à©`¥Ó©`¤òÔÙÉú¤¹¤ë
;		Ö¸¶¨¥à©`¥Ó©`¥Õ¥¡¥¤¥ë¤òÔÙÉú¤·¤Þ¤¹
;		ÔÙÉú¤¬½KÁË¤·¤¿áá¤â¥à©`¥Ó©`¤Î»­Ïñ¤Ï²Ð¤Ã¤Æ¤¤¤Þ¤¹¤Î¤Ç¡¢
;		ááÊö¤Î CloaseMovie ¥³¥Þ¥ó¥É¤òÊ¹ÓÃ¤·¤Æ»­Ãæ¤òÏûÈ¥¤·¤Æ¤¯¤À¤µ¤¤
;		file		: ¥Õ¥¡¥¤¥ëÃû
;		[layer]		: Ãè»­¤¹¤ë¥ì¥¤¥ä·¬ºÅ (def:-1 ŒŸÓÃ¥ì¥¤¥ä¤òÊ¹ÓÃ¤·×îÇ°Ãæ¤ØÃè»­)
;		[loop]		: ¥ë©`¥×¥Õ¥é¥° (def:0)
;		[mode]		: PLAY MODE (def:0) 0:Overlay Mode
;										1:Layer   Mode
;										2:Mixer   Mode
;
;		[cursor]	: ¥«©`¥½¥ë±íÊ¾9§9·Ç±íÊ¾ (±íÊ¾:1 ·Ç±íÊ¾:0)(def:1)
;		[cancel]	: ¥­¥ã¥ó¥»¥ë¥Õ¥é¥° (ÔS¿É:0 ¡ù1ÒÔÉÏ¤ÏÌõ¼þ¸¶¤­ÔS¿É -1:²»ÔS¿É)(def:0)
;					¡ùwait¤ò[Ö¹¤á¤Ê¤¤]¤Ë¤·¤¿ˆöºÏ¤Ï¥¹¥¯¥ê¥×¥È‚È¤«¤éÍ£Ö¹¤µ¤»¤ë±ØÒª¤¬¤¢¤ê¤Þ¤¹
;					
;		[wait]		: ÔÙÉú½KÁË•r¤Þ¤Ç¥¹¥¯¥ê¥×¥È¤ÎÖÆÓù¤òÖ¹¤á¤ë¤« (0:Ö¹¤á¤Ê¤¤ 1:Ö¹¤á¤ë)(def:1)
;					¡ù[Ö¹¤á¤ë]¤Ë¤·¤Æ[loop]¥Õ¥é¥°¤¬ON¤ÎˆöºÏ½KÁË¥¤¥Ù¥ó¥È¤¬°kÉú¤·¤Ê¤¤¤Î¤ÇÖ¸¶¨³öÀ´¤Þ¤»¤ó
;
;	¡ùMODE¤ÎÕhÃ÷
;
;	Overlay Mode
;	
;	Overlay¤ÏDirectDraw¤òÊ¹ÓÃ¤·¤ÆMOVIE¤òÔÙÉú¤¹¤ë¥â©`¥É¤Ç¤¹¡£
;	ŠÖÆµÄ¤Ë×îÇ°Ãæ¤ÎÎ»ÖÃ¤ÇÔÙÉú¤µ¤ì¤Þ¤¹¡£
;	¾¤Ã¤Æ½KÁË´_ÕJ¤Ê¤É¤Î±íÊ¾¤¬¤Ç¤­¤Þ¤»¤ó
;	ÔÙÉú„IÀí¤ÏÒ»·¬ÝX¤¤¥â©`¥É¤Ç¤¹¡£
;
;
;	Layer Mode
;	
;	LayerMode¤Ï»­ÏñÃè»­¤¹¤ë¥ì¥¤¥ä¤ËMOVIE¤ò±íÊ¾¤¹¤ë¥â©`¥É¤Ç¤¹¡£
;	»­Ïñ¥ì¥¤¥ä¤Ê¤Î¤Ç¡¢¥ì¥¤¥ä¤ÎÎ»ÖÃ¤òÖ¸¶¨¤¹¤ë¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£
;	ÔÙÉú„IÀí¤ÏOverlay¤Ë±È¤Ù¤ë¤ÈÈô¸ÉÖØ¤¤¤Ç¤¹¡£
;
;
;	Mixer Mode
;
;	MixerMode¤Ï¥ì¥¤¥ä¤ËÃè»­¤·¤Ä¤Ä¡¢»­Ïñ¤Î¥¢¥ë¥Õ¥¡‚Ž¤òÔO¶¨¤Ç¤­¤ë
;	¥â©`¥É¤Ç¤¹¡££³¤Ä¤Î¥â©`¥É¤Ç¤ÏÔÙÉú„IÀí¤¬Ò»·¬ÖØ¤¤¤Ç¤¹¡£
;
;
;
;	¡ùŒêÐÎÊ½
;
;	ÔÙÉú¿ÉÄÜ¤ÊÐÎÊ½¤Ïmpg¡¢wmv¤Ç¤¹¡£
;
;	¤¿¤À¤·¡¢wmv¤ÏOverlay Mode¤À¤È¥Õ¥ë¥¹¥¯¥ê©`¥ó•r¤Ë†–î}¤¬¤Ç¤ë¤Î¤Ç¡¢
;	wmv¤òÊ¹ÓÃ¤¹¤ëˆöºÏ¤ÏLayerMode¤òÖ¸¶¨¤¹¤ë±ØÒª¤¬¤¢¤ê¤Þ¤¹¡£
;
;
;	LayerMode¤òÊ¹ÓÃ¤¹¤ëëH¤Ï¡¢»­Ïñ¤Î’ˆ¿sÑaÍê¤¬¤µ¤ì¤Ê¤¤¤¿¤á»­Ãæ¥µ¥¤¥º¤Î
;	MOVIE¤¬±ØÒª¤Ë¤Ê¤ê¤Þ¤¹¡£(mpg¤Ç¤âÍ¬˜”)
;
;	Layer Mode¤Ç¤Ê¤¤¤ÈÔÙÉúÖÐ¤Ë¥Þ¥¦¥¹¥«©`¥½¥ë¤ÎÏûÈ¥¤¬¤Ç¤­¤Þ¤»¤ó¡£
;
[macro name = macPlayMovie]
	[playmovie file=%file layer=%layer|-1 loop=%loop|0 mode=%mode|0 cursor=%cursor|1 cancel=%cancel|0 wait=%wait|1]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥à©`¥Ó©`»­Ïñ¤òÏûÈ¥¤¹¤ë
;		ÔÙÉú½KÁË¤·¤¿¥à©`¥Ó©`»­Ãæ¤òÏûÈ¥¤·¤Þ¤¹
;		¥È¥é¥ó¥¸¥·¥ç¥ó¤ò¤«¤±¤Æ¥à©`¥Ó©`¤òÏûÈ¥¤·¤¿¤¤ˆöºÏ¤Ê¤É¤ËÊ¹ÓÃ¤·¤Þ¤¹
;		¡ù¤³¤Î¥³¥Þ¥ó¥É¤ÏÍ£Ö¹¤Ç¤Ê¤¯¡¢ÔÙÉú½KÁË•r¤ËÊ¹ÓÃ¤¹¤ë¤â¤Î¤Ç¤¹
[macro name = macCloseMovie]
	[CloseMovie]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥à©`¥Ó©`¤òÍ£Ö¹¤¹¤ë
;		ÔÙÉúÖÐ¤Î¥à©`¥Ó©`¤òÍ£Ö¹¤·¤Þ¤¹
;		¥ë©`¥×ÔÙÉú¤·¤¿¥à©`¥Ó©`¤Ï¤³¤Î¥³¥Þ¥ó¥É¤òÊ¹ÓÃ¤·¤Æ¥à©`¥Ó©`¤òÍ£Ö¹¤µ¤»¤ë
;		±ØÒª¤¬¤¢¤ê¤Þ¤¹
;		¡ù¤³¤Î¥³¥Þ¥ó¥É¤Îáá¤Ë¤Ï macCloseMovie ¤òÊ¹ÓÃ¤·¤Æ»­Ãæ¤òÏûÈ¥¤·¤Æ¤¯¤À¤µ¤¤
[macro name = macStopMovie]
	[StopMovie]
[endmacro]

;-------------------------------------------------------------------------------







;-------------------------------------------------------------------------------
; »­ÃæÑÝ³ö¥³¥Þ¥ó¥É
;-------------------------------------------------------------------------------

;	¡ð±³¾°¥ì¥¤¥ä‰T¤ê¤Ä¤Ö¤·
;	[color]		: É«‚Ž(16ßMÊý¤ÇÖ¸¶¨) (def:coBLACK)
;
;	¡ùÈ«¥ì¥¤¥ä¤òÒ»¶ÈÆÆ—‰¤·¤Æ¡¢0·¬¥ì¥¤¥ä¤òÖ¸¶¨É«¤Ç‰T¤ê¤Ä¤Ö¤¹
;	¥³¥Þ¥ó¥É¤Ç¤¹

[macro name = macBackColor]
	[ImageFree layer=-1]
	[ImageFill layer=0 color=%color|coBLACK]
[endmacro]

;-------------------------------------------------------------------------------
;
;	¡ð¥È¥é¥ó¥¸¥·¥ç¥óœÊ‚ä¥³¥Þ¥ó¥É
;
;	¡ù¥È¥é¥ó¥¸¥·¥ç¥óÏµ„IÀí¤òÐÐ¤¦¤¿¤á¤ÎœÊ‚ä¥³¥Þ¥ó¥É¤Ç¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥ÉÊ¹ÓÃáá¤Ç¤Ê¤¤¤È¡¢¥È¥é¥ó¥¸¥·¥ç¥ó¡¢¥Õ¥§©`¥É¤Ê¤É¤Î¥³¥Þ¥ó¥É¤¬
;	„Ó×÷¤·¤Þ¤»¤ó¤Î¤Ç¡¢Ê¹ÓÃ¤¹¤ë¤Î¤òÍü¤ì¤Ê¤¤¤Ç¤¯¤À¤µ¤¤

[macro name = macTransSet]
	[TransSet]
[endmacro]


;	¡ö¥È¥é¥ó¥¸¥·¥ç¥ó¡¢¥Õ¥§©`¥ÉÏµ¥³¥Þ¥ó¥É¤ÎÕhÃ÷
;	
;	¥È¥é¥ó¥¸¥·¥ç¥ó¡¢¥Õ¥§©`¥ÉÏµ¤Ê¤É¤Î¥³¥Þ¥ó¥É¤Ç¤¹¤¬¡¢’¤„Ó¤ÏÍ¬¤¸„IÀí¤ò
;	¤·¤Æ¤¤¤Þ¤¹
;	
;	¤³¤Î [macTransSet] ¥³¥Þ¥ó¥É¤Ï¡¢¬FÔÚ±íÊ¾¤µ¤ì¤Æ¤¤¤ë»­Ãæ¤ò¥­¥ã¥×¥Á¥ã©`¤·¤Æ×îÇ°Ãæ¤Ø±íÊ¾¤¹¤ë
;	¤È¤¤¤¦„IÀí¤òÐÐ¤Ã¤Æ¤¤¤Þ¤¹(¥á¥Ã¥»©`¥¸¥Õ¥ì©`¥à¤è¤ê¤âÊÖÇ°¤Ç¤¹)
;	
;	¤½¤·¤Æ¡¢¥È¥é¥ó¥¸¥·¥ç¥ó¡¢¥Õ¥§©`¥ÉÏµ¥³¥Þ¥ó¥É¤Ï±íÊ¾¤µ¤ì¤Æ¤¤¤ë¥­¥ã¥×¥Á¥ã©`»­Ïñ¤òÏûÈ¥¤¹¤ë
;	¤È¤¤¤¦„IÀí¤òÐÐ¤Ã¤Æ¤¤¤Þ¤¹
;	
;	¥­¥ã¥×¥Á¥ã©`»­Ïñ¤Ï¥«©`¥Æ¥ó¤ò¥¤¥á©`¥¸¤·¤Æ¤â¤é¤¨¤ë¤ÈÅÐ¤êÒ×¤¤¤ÈË¼¤¤¤Þ¤¹
;	¥«©`¥Æ¥ó¤ÇëL¤·¤Æ¤ª¤¤¤Æ¡¢¥«©`¥Æ¥óÄÚ²¿¤Ç‰ä¸ü¤·¤Æ¤ª¤­¡¢ÍêÁË¤·¤¿¤é¥«©`¥Æ¥ó¤òé_¤±¤ë¤È¤¤¤¦Á÷¤ì¤Ç¤¹
;	ÒÔÏÂ¡¢ŒgëH¤Î¥³¥Þ¥ó¥ÉÓ›ÊöÀý¤Ç¤¹
;
;Àý£º
;
;	//¡ï¡²¡¡±³¾°¡¡¡³ÆßÉ­¼Ò9§9¥Þ¥ó¥·¥ç¥óÍâÓQ9§9Ò¹£±
;	[macImageDraw file=BG_07C_01]
;
;	[Talk name=¥Æ¥¹¥È]
;	±³¾°£Â£Ç£ß£°£·£Ã£ß£°£±¤¬±íÊ¾¤µ¤ì¤Æ¤¤¤Þ¤¹
;	[Hitret]
;
;	//£ª¬FÔÚ±íÊ¾¤µ¤ì¤Æ¤¤¤ë»­Ãæ¤ò¥­¥ã¥×¥Á¥ã©`¤·¤Æ×îÇ°Ãæ¤Ë±íÊ¾
;	[macTransSet]
;
;	¡ù¤³¤³¤«¤é¥Õ¥§©`¥É¥³¥Þ¥ó¥É¤Þ¤Ç¡¢¥­¥ã¥×¥Á¥ã©`»­Ïñ¤ËëL¤ì¤Æ¤¤¤ë¤Î¤Ç
;	ŒgëH¤Ë¤Ï»­Ãæ¤Ë±íÊ¾¤µ¤ì¤Æ¤¤¤Þ¤»¤ó
;	¥­¥ã¥×¥Á¥ã©`»­Ïñ¤ÇëL¤·¤Æ¤¤¤ëég¤Ë»­Ïñ‰ä¸ü¤òÐÐ¤¤¤Þ¤¹
;
;	//¡ï¡²¡¡±³¾°¡¡¡³ÆßÉ­¼Ò9§9¥ê¥Ó¥ó¥°¥­¥Ã¥Á¥ó9§9Ò¹£±
;	[macImageDraw file=BG_04C_01]
;	//¡ï¡²¡¡Á¢¤Á½}¡¡¡³¤ß¤ë¤¯9§9Ë½·þ(£ÁÕýÃæ)9§9Ï²¤Ó£¯Ð¦¤¤£Ã
;	[macImageDraw file=CH_A200L_01B layer=1  pos=c ]
;
;	//£ª¥Õ¥§©`¥É±íÊ¾ ¡û¥­¥ã¥×¥Á¥ã©`»­Ïñ¤ò¥Õ¥§©`¥É¤ÇÏ÷³ý¤¹¤ë
;	// »­Ãæ¤Ç¤Ï¸üÐÂ¤·¤¿»­Ïñ¤¬¥Õ¥§©`¥É±íÊ¾¤µ¤ì¤¿¤è¤¦¤ËÒŠ¤¨¤ë
;	[macFade time=1000]
;
;	[Talk name=¥Æ¥¹¥È]
;	±³¾°¤ÈÁ¢¤Á½}¤¬¸üÐÂ¤µ¤ì¤Æ¥Õ¥§©`¥É¤Ç±íÊ¾¤µ¤ì¤Þ¤·¤¿
;	[Hitret]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥§©`¥É¸üÐÂ
;		[time]		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»] (def:300ms)

;	¡ù[macTransSet] ¤Ç±íÊ¾¤µ¤ì¤¿¥­¥ã¥×¥Á¥ã©`»­Ïñ¤ò¥Õ¥§©`¥É¤ÇÏûÈ¥¤·¤Þ¤¹
;	¡¡[macTransSet] ¤òÊ¹ÓÃ¤·¤Æ¤¤¤ë×´‘B¤ÇÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macFade]
	[fadework time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥§©`¥É¥¢¥¦¥È
;		[time]		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»] (def:1000ms)
;		[color]		: É«‚Ž(16ßMÊý¤ÇÖ¸¶¨) (def:coBLACK)
;		[mes]		: ¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦¤ò²Ð¤¹¤«£¿ (def:0 ²Ð¤µ¤Ê¤¤)9§91¤Ç²Ð¤¹

;	¡ùÄÚ²¿¤Ç [macTransSet] ¤òÐÐ¤Ã¤Æ¤¤¤ë¤Î¤Ç¡¢¤³¤Î¥³¥Þ¥ó¥ÉÇ°¤Ë¤Ï [macTransSet] ¤ÏÖ¸¶¨¤¹¤ë
;	¡¡±ØÒª¤Ï¤¢¤ê¤Þ¤»¤ó
;	¡ù0·¬¥ì¥¤¥äÒÔÍâ¤ò¥Õ¥§©`¥É¤·¤Ê¤¬¤éÏûÈ¥¤·¡¢0·¬¥ì¥¤¥ä¤òÖ¸¶¨É«¤Ç‰T¤ê¤Ä¤Ö¤·¤Æ±íÊ¾¤·¤Þ¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢¥Õ¥§©`¥É½KÁË¤ò´ý¤Ã¤Æ¤«¤é¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹
;	¡ù¶¨Áx¤µ¤ì¤Æ¤¤¤ëÉ«Ò»ÓE (Ëû¤ÎÉ«¤Ï¥Õ¥©¥È¥·¥ç¥Ã¥×¤Ê¤É¤ÇÕ{¤Ù¤ÆÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤)

;	var	coBLACK	= 0x000000
;	var coWHITE	= 0xffffff
;	var coRED	= 0xff0000
;	var coGREEN	= 0x00ff00
;	var coBLUE	= 0x0000ff
;	var coAQUA	= 0x00ffff
;	var coPURPLE= 0xff00ff
;	var coYELLOW= 0xffff00

[macro name = macFadeOut]
	;¬FÔÚ¤Î»­Ãæ¤ò¥­¥ã¥×¥Á¥ã©`¤¹¤ë
	[macTransSet]
	
	;¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦ÔO¶¨¤¬0(²Ð¤µ¤Ê¤¤)¤ÎˆöºÏ
	[macWindowView type=%mes|0]
	
	[macImageFree layer=-1]
	[macImageFill color=%color|coBLACK]
	
	[macFade time=%time|1000]
	
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥È¥é¥ó¥¸¥·¥ç¥ó¸üÐÂ
;		file		: ¥ë©`¥ë¥Õ¥¡¥¤¥ë(’ˆˆ×ÓŸo¤·¤ÇÖ¸¶¨)
;		[time]		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»] (def:300ms)

;	¡ù[macTransSet] ¤Ç±íÊ¾¤µ¤ì¤¿¥­¥ã¥×¥Á¥ã©`»­Ïñ¤ò¥ë©`¥ë»­Ïñ¤òÊ¹ÓÃ¤·¤ÆÏûÈ¥¤·¤Þ¤¹
;	¡¡[macTransSet] ¤òÊ¹ÓÃ¤·¤Æ¤¤¤ë×´‘B¤ÇÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macTrans]
	[transwork file=%file time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥È¥é¥ó¥¸¥·¥ç¥óÏû¤·
;		file		: ¥ë©`¥ë¥Õ¥¡¥¤¥ë(’ˆˆ×ÓŸo¤·¤ÇÖ¸¶¨)
;		[time]		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»] (def:1000ms)
;		[color]		: É« (def:coBLACK)
;		[mes]		: ¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦¤ò²Ð¤¹¤«£¿ (def:0 ²Ð¤µ¤Ê¤¤)9§91¤Ç²Ð¤¹

;	¡ùÈ«¤Æ¤Î¥ì¥¤¥ä¤ò¥È¥é¥ó¥¸¥·¥ç¥ó¤ÇÏûÈ¥¤·¤Þ¤¹(0·¬¥ì¥¤¥ä¤Ï×÷³É¤µ¤ì¤Þ¤¹)
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢½KÁË¤ò´ý¤Ã¤Æ¤«¤é¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹
;	¡ùÄÚ²¿¤Ç [macTransSet] ¤òÐÐ¤Ã¤Æ¤¤¤ë¤Î¤Ç¡¢¤³¤Î¥³¥Þ¥ó¥ÉÇ°¤Ë¤Ï [macTransSet] ¤ÏÖ¸¶¨¤¹¤ë
;	¡¡±ØÒª¤Ï¤¢¤ê¤Þ¤»¤ó
;	¡ù¶¨Áx¤µ¤ì¤Æ¤¤¤ëÉ«Ò»ÓE (Ëû¤ÎÉ«¤Ï¥Õ¥©¥È¥·¥ç¥Ã¥×¤Ê¤É¤ÇÕ{¤Ù¤ÆÖ¸¶¨¤·¤Æ¤¯¤À¤µ¤¤)
;	¡¡½M¤ßÞz¤ß‚È¤Ç¶¨Áx¤·¤Ê¤¤¤ÈÊ¹ÓÃ¤Ç¤­¤Ê¤¤¤Î¤ÇßB½j¤ªîŠ¤¤¤·¤Þ¤¹
;	¡¡coBLACK	= 0x000000
;	¡¡coWHITE	= 0xffffff
;	¡¡coRED		= 0xff0000
;	¡¡coGREEN	= 0x00ff00
;	¡¡coBLUE	= 0x0000ff
;	¡¡coAQUA	= 0x00ffff
;	¡¡coPURPLE	= 0xff00ff
;	¡¡coYELLOW	= 0xffff00

[macro name = macTransOut]
	
	;¬FÔÚ¤Î»­Ãæ¤ò¥­¥ã¥×¥Á¥ã©`¤¹¤ë
	[macTransSet]
	
	;¥á¥Ã¥»©`¥¸¥¦¥£¥ó¥É¥¦ÔO¶¨¤¬0(²Ð¤µ¤Ê¤¤)¤ÎˆöºÏ
	[macWindowView type=%mes|0]
	
	;»­Ïñ È«Ïû¤·
	[macImageFree layer=-1]
	
	;É«Ö¸¶¨¤·¤¿ˆöºÏ
	[macImageFill color=%color|coBLACK]
	
	;•régÖ¸¶¨¤·¤¿ˆöºÏ
	[macTrans file=%file time=%time|1000]
	
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥¯¥§¥¤¥¯
;		[time]		: ÍêÁË¤Þ¤Ç¤Î•rég [ms…gÎ»] (def:500ms)
;		[x]			: £Ø“e¤ì·ù (def:0)
;		[y]			: £Ù“e¤ì·ù (def:0)
;		[mode]		: ¥â©`¥É (def:0) 0:Í¨³£
;									 1:»­ÃæÍâ…gÉ«‰T¤ê¤Ä¤Ö¤·
;		[color]		: É«‚Ž(16ßMÊý¤ÇÖ¸¶¨) (def:coBLACK)

;	¡ù»­ÃæÈ«Ìå¤ò“e¤é¤·¤Þ¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢¥¯¥§¥¤¥¯½KÁË¤ò´ý¤Ã¤Æ¤«¤é¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹
;	¡ù[»­ÃæÍâ…gÉ«‰T¤ê¤Ä¤Ö¤·]¤Ï±³¾°¤¬»­ÃæÒ»±­¤Î¥µ¥¤¥º¤·¤«¤Ê¤¤ˆöºÏ¡¢
;	¡¡¤º¤ì¤¿ëH¤ËÒŠ¤¨¤ë»­Ãæ¤ÎÉ«¤òÖ¸¶¨¤·¤Þ¤¹

[macro name = macQuake]
	[quake time=%time|500 hmax=%x|0 vmax=%y|0 mode=%mode|0 color=%color|coBLACK]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­Ïñ¥ì¥¤¥ä…gÎ»¤Î“e¤é¤·
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0 Ö¸¶¨¿ÉÄÜ·¬ºÅ¤ÏSYSTEMÔO¶¨Õß¤Ë´_ÕJ)
;		x			: “e¤ì·ù£Ø ( - Ö¸¶¨¤Ç×ó¡¢+ Ö¸¶¨( + ¤ÏÊ¡ÂÔ¿É)¤ÇÓÒ)
;		y			: “e¤ì·ù£Ù ( - Ö¸¶¨¤ÇÉÏ¡¢+ Ö¸¶¨( + ¤ÏÊ¡ÂÔ¿É)¤ÇÏÂ)
;		[type]		: s:…g·½Ïò w:Ë«·½Ïò (def:s)
;		[cnt]		: “e¤é¤·»ØÊý (def:1)
;		[time]		: ÒÆ„Ó•rég [ms…gÎ»] (def:220)
;		[delay]		: ÒÆ„Óé_Ê¼¤Þ¤Ç¤Î´ý¤Á•rég [ms…gÎ»] (def:0)
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢“e¤é¤·½KÁË¤ò´ý¤Ã¤Æ¤«¤é¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Îáá¤Ë¤Ï¡¢[macWaitMove]¥³¥Þ¥ó¥É¤òÈë¤ì¤Æ¤¯¤À¤µ¤¤
;	¡ùÑ}Êý¥ì¥¤¥ä¤òÍ¬•r¤Ë“e¤é¤¹ˆöºÏ¤Ï[macWaitMove]¥³¥Þ¥ó¥É¤ÎÈë¤ì·½¤Ë×¢Òâ¤·¤Æ¤¯¤À¤µ¤¤

[macro name = macImageShake]
	[SpPath x=%x y=%y cnt=%cnt|1 layer=%layer|0 type=%type|s]
	[imagespmove layer=%layer|0 path="&f.path" time=%time|220 delay=%delay|0 functype=0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð»­ÏñÍ¸ß^¶ÈÔO¶¨
;		[layer]		: ¥ì¥¤¥ä·¬ºÅ (def:0 Ö¸¶¨¿ÉÄÜ·¬ºÅ¤ÏSYSTEMÔO¶¨Õß¤Ë´_ÕJ)
;		opacity		: Í¸ß^¶È (Í¸Ã÷0¡«²»Í¸Ã÷255¤Î½~ŒÖ¸¶¨)
;		[time]		: Ö¸¶¨Í¸ß^¶È¤Ë¤«¤«¤ë¤Þ¤Ç¤Î•rég(def:0)
;	¡ù»­Ïñ¥ì¥¤¥ä¤ÎÍ¸ß^¶È¤òÔO¶¨¤·¤Þ¤¹¡£
;	[macWaitMove]¤È¥»¥Ã¥È¤ÇÊ¹ÓÃ¤·¤Æ¤¯¤À¤µ¤¤¡£

[macro name = macImageOpacity]
;	Í¸ß^¶È¤Î¬FÔÚ‚Ž¤ò´úÈë
	[imagemove layer=%layer|0 x=0 y=0 opacity=%opacity time=%time|0 delay=0 accel=0]
[endmacro]

;-------------------------------------------------------------------------------

;	¡ð¥Õ¥é¥Ã¥·¥å
;		[color]		: É«‚Ž(16ßMÊý¤ÇÖ¸¶¨) (def:coWHITE)
;		[nun]		: »ØÊý (def:1)
;		[time]		: µãœç•rég [ms…gÎ»] (def:300ms)


;	¡ù»­ÃæÈ«Ìå¤ò¥Õ¥é¥Ã¥·¥å¤µ¤»¤Þ¤¹
;	¡ù¤³¤Î¥³¥Þ¥ó¥É¤Ï¡¢¥Õ¥é¥Ã¥·¥å½KÁË¤ò´ý¤Ã¤Æ¤«¤é¥á¥Ã¥»©`¥¸¤ò±íÊ¾¤·¤Þ¤¹

[macro name = macFlash]
	[flash color=%color|coWHITE num=%num|1 time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------








[return]

= macBackColor]
	[ImageFree layer=-1]
	[ImageFill layer=0 color=%color|coBLACK]
[endmacro]

;-------------------------------------------------------------------------------
;
;	â—‹ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³æº–å‚™ã‚³ãƒžãƒ³ãƒ‰
;
;	â€»ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ç³»å‡¦ç†ã‚’è¡Œã†ãŸã‚ã®æº–å‚™ã‚³ãƒžãƒ³ãƒ‰ã§ã™
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ä½¿ç”¨å¾Œã§ãªã„ã¨ã€ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ã€ãƒ•ã‚§ãƒ¼ãƒ‰ãªã©ã®ã‚³ãƒžãƒ³ãƒ‰ãŒ
;	å‹•ä½œã—ã¾ã›ã‚“ã®ã§ã€ä½¿ç”¨ã™ã‚‹ã®ã‚’å¿˜ã‚Œãªã„ã§ãã ã•ã„

[macro name = macTransSet]
	[TransSet]
[endmacro]


;	â– ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ã€ãƒ•ã‚§ãƒ¼ãƒ‰ç³»ã‚³ãƒžãƒ³ãƒ‰ã®èª¬æ˜Ž
;	
;	ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ã€ãƒ•ã‚§ãƒ¼ãƒ‰ç³»ãªã©ã®ã‚³ãƒžãƒ³ãƒ‰ã§ã™ãŒã€æŒ™å‹•ã¯åŒã˜å‡¦ç†ã‚’
;	ã—ã¦ã„ã¾ã™
;	
;	ã“ã® [macTransSet] ã‚³ãƒžãƒ³ãƒ‰ã¯ã€ç¾åœ¨è¡¨ç¤ºã•ã‚Œã¦ã„ã‚‹ç”»é¢ã‚’ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ã—ã¦æœ€å‰é¢ã¸è¡¨ç¤ºã™ã‚‹
;	ã¨ã„ã†å‡¦ç†ã‚’è¡Œã£ã¦ã„ã¾ã™(ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ãƒ•ãƒ¬ãƒ¼ãƒ ã‚ˆã‚Šã‚‚æ‰‹å‰ã§ã™)
;	
;	ãã—ã¦ã€ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ã€ãƒ•ã‚§ãƒ¼ãƒ‰ç³»ã‚³ãƒžãƒ³ãƒ‰ã¯è¡¨ç¤ºã•ã‚Œã¦ã„ã‚‹ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã‚’æ¶ˆåŽ»ã™ã‚‹
;	ã¨ã„ã†å‡¦ç†ã‚’è¡Œã£ã¦ã„ã¾ã™
;	
;	ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã¯ã‚«ãƒ¼ãƒ†ãƒ³ã‚’ã‚¤ãƒ¡ãƒ¼ã‚¸ã—ã¦ã‚‚ã‚‰ãˆã‚‹ã¨åˆ¤ã‚Šæ˜“ã„ã¨æ€ã„ã¾ã™
;	ã‚«ãƒ¼ãƒ†ãƒ³ã§éš ã—ã¦ãŠã„ã¦ã€ã‚«ãƒ¼ãƒ†ãƒ³å†…éƒ¨ã§å¤‰æ›´ã—ã¦ãŠãã€å®Œäº†ã—ãŸã‚‰ã‚«ãƒ¼ãƒ†ãƒ³ã‚’é–‹ã‘ã‚‹ã¨ã„ã†æµã‚Œã§ã™
;	ä»¥ä¸‹ã€å®Ÿéš›ã®ã‚³ãƒžãƒ³ãƒ‰è¨˜è¿°ä¾‹ã§ã™
;
;ä¾‹ï¼š
;
;	//â˜…ã€”ã€€èƒŒæ™¯ã€€ã€•ä¸ƒæ£®å®¶ãƒ»ãƒžãƒ³ã‚·ãƒ§ãƒ³å¤–è¦³ãƒ»å¤œï¼‘
;	[macImageDraw file=BG_07C_01]
;
;	[Talk name=ãƒ†ã‚¹ãƒˆ]
;	èƒŒæ™¯ï¼¢ï¼§ï¼¿ï¼ï¼—ï¼£ï¼¿ï¼ï¼‘ãŒè¡¨ç¤ºã•ã‚Œã¦ã„ã¾ã™
;	[Hitret]
;
;	//ï¼Šç¾åœ¨è¡¨ç¤ºã•ã‚Œã¦ã„ã‚‹ç”»é¢ã‚’ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ã—ã¦æœ€å‰é¢ã«è¡¨ç¤º
;	[macTransSet]
;
;	â€»ã“ã“ã‹ã‚‰ãƒ•ã‚§ãƒ¼ãƒ‰ã‚³ãƒžãƒ³ãƒ‰ã¾ã§ã€ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã«éš ã‚Œã¦ã„ã‚‹ã®ã§
;	å®Ÿéš›ã«ã¯ç”»é¢ã«è¡¨ç¤ºã•ã‚Œã¦ã„ã¾ã›ã‚“
;	ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã§éš ã—ã¦ã„ã‚‹é–“ã«ç”»åƒå¤‰æ›´ã‚’è¡Œã„ã¾ã™
;
;	//â˜…ã€”ã€€èƒŒæ™¯ã€€ã€•ä¸ƒæ£®å®¶ãƒ»ãƒªãƒ“ãƒ³ã‚°ã‚­ãƒƒãƒãƒ³ãƒ»å¤œï¼‘
;	[macImageDraw file=BG_04C_01]
;	//â˜…ã€”ã€€ç«‹ã¡çµµã€€ã€•ã¿ã‚‹ããƒ»ç§æœ(ï¼¡æ­£é¢)ãƒ»å–œã³ï¼ç¬‘ã„ï¼£
;	[macImageDraw file=CH_A200L_01B layer=1  pos=c ]
;
;	//ï¼Šãƒ•ã‚§ãƒ¼ãƒ‰è¡¨ç¤º â†ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã‚’ãƒ•ã‚§ãƒ¼ãƒ‰ã§å‰Šé™¤ã™ã‚‹
;	// ç”»é¢ã§ã¯æ›´æ–°ã—ãŸç”»åƒãŒãƒ•ã‚§ãƒ¼ãƒ‰è¡¨ç¤ºã•ã‚ŒãŸã‚ˆã†ã«è¦‹ãˆã‚‹
;	[macFade time=1000]
;
;	[Talk name=ãƒ†ã‚¹ãƒˆ]
;	èƒŒæ™¯ã¨ç«‹ã¡çµµãŒæ›´æ–°ã•ã‚Œã¦ãƒ•ã‚§ãƒ¼ãƒ‰ã§è¡¨ç¤ºã•ã‚Œã¾ã—ãŸ
;	[Hitret]

;-------------------------------------------------------------------------------

;	â—‹ãƒ•ã‚§ãƒ¼ãƒ‰æ›´æ–°
;		[time]		: å®Œäº†ã¾ã§ã®æ™‚é–“ [mså˜ä½] (def:300ms)

;	â€»[macTransSet] ã§è¡¨ç¤ºã•ã‚ŒãŸã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã‚’ãƒ•ã‚§ãƒ¼ãƒ‰ã§æ¶ˆåŽ»ã—ã¾ã™
;	ã€€[macTransSet] ã‚’ä½¿ç”¨ã—ã¦ã„ã‚‹çŠ¶æ…‹ã§ä½¿ç”¨ã—ã¦ãã ã•ã„

[macro name = macFade]
	[fadework time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ãƒ•ã‚§ãƒ¼ãƒ‰ã‚¢ã‚¦ãƒˆ
;		[time]		: å®Œäº†ã¾ã§ã®æ™‚é–“ [mså˜ä½] (def:1000ms)
;		[color]		: è‰²å€¤(16é€²æ•°ã§æŒ‡å®š) (def:coBLACK)
;		[mes]		: ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦ã‚’æ®‹ã™ã‹ï¼Ÿ (def:0 æ®‹ã•ãªã„)ãƒ»1ã§æ®‹ã™

;	â€»å†…éƒ¨ã§ [macTransSet] ã‚’è¡Œã£ã¦ã„ã‚‹ã®ã§ã€ã“ã®ã‚³ãƒžãƒ³ãƒ‰å‰ã«ã¯ [macTransSet] ã¯æŒ‡å®šã™ã‚‹
;	ã€€å¿…è¦ã¯ã‚ã‚Šã¾ã›ã‚“
;	â€»0ç•ªãƒ¬ã‚¤ãƒ¤ä»¥å¤–ã‚’ãƒ•ã‚§ãƒ¼ãƒ‰ã—ãªãŒã‚‰æ¶ˆåŽ»ã—ã€0ç•ªãƒ¬ã‚¤ãƒ¤ã‚’æŒ‡å®šè‰²ã§å¡—ã‚Šã¤ã¶ã—ã¦è¡¨ç¤ºã—ã¾ã™
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã¯ã€ãƒ•ã‚§ãƒ¼ãƒ‰çµ‚äº†ã‚’å¾…ã£ã¦ã‹ã‚‰ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’è¡¨ç¤ºã—ã¾ã™
;	â€»å®šç¾©ã•ã‚Œã¦ã„ã‚‹è‰²ä¸€è¦§ (ä»–ã®è‰²ã¯ãƒ•ã‚©ãƒˆã‚·ãƒ§ãƒƒãƒ—ãªã©ã§èª¿ã¹ã¦æŒ‡å®šã—ã¦ãã ã•ã„)

;	var	coBLACK	= 0x000000
;	var coWHITE	= 0xffffff
;	var coRED	= 0xff0000
;	var coGREEN	= 0x00ff00
;	var coBLUE	= 0x0000ff
;	var coAQUA	= 0x00ffff
;	var coPURPLE= 0xff00ff
;	var coYELLOW= 0xffff00

[macro name = macFadeOut]
	;ç¾åœ¨ã®ç”»é¢ã‚’ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ã™ã‚‹
	[macTransSet]
	
	;ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦è¨­å®šãŒ0(æ®‹ã•ãªã„)ã®å ´åˆ
	[macWindowView type=%mes|0]
	
	[macImageFree layer=-1]
	[macImageFill color=%color|coBLACK]
	
	[macFade time=%time|1000]
	
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³æ›´æ–°
;		file		: ãƒ«ãƒ¼ãƒ«ãƒ•ã‚¡ã‚¤ãƒ«(æ‹¡å¼µå­ç„¡ã—ã§æŒ‡å®š)
;		[time]		: å®Œäº†ã¾ã§ã®æ™‚é–“ [mså˜ä½] (def:300ms)

;	â€»[macTransSet] ã§è¡¨ç¤ºã•ã‚ŒãŸã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ç”»åƒã‚’ãƒ«ãƒ¼ãƒ«ç”»åƒã‚’ä½¿ç”¨ã—ã¦æ¶ˆåŽ»ã—ã¾ã™
;	ã€€[macTransSet] ã‚’ä½¿ç”¨ã—ã¦ã„ã‚‹çŠ¶æ…‹ã§ä½¿ç”¨ã—ã¦ãã ã•ã„

[macro name = macTrans]
	[transwork file=%file time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³æ¶ˆã—
;		file		: ãƒ«ãƒ¼ãƒ«ãƒ•ã‚¡ã‚¤ãƒ«(æ‹¡å¼µå­ç„¡ã—ã§æŒ‡å®š)
;		[time]		: å®Œäº†ã¾ã§ã®æ™‚é–“ [mså˜ä½] (def:1000ms)
;		[color]		: è‰² (def:coBLACK)
;		[mes]		: ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦ã‚’æ®‹ã™ã‹ï¼Ÿ (def:0 æ®‹ã•ãªã„)ãƒ»1ã§æ®‹ã™

;	â€»å…¨ã¦ã®ãƒ¬ã‚¤ãƒ¤ã‚’ãƒˆãƒ©ãƒ³ã‚¸ã‚·ãƒ§ãƒ³ã§æ¶ˆåŽ»ã—ã¾ã™(0ç•ªãƒ¬ã‚¤ãƒ¤ã¯ä½œæˆã•ã‚Œã¾ã™)
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã¯ã€çµ‚äº†ã‚’å¾…ã£ã¦ã‹ã‚‰ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’è¡¨ç¤ºã—ã¾ã™
;	â€»å†…éƒ¨ã§ [macTransSet] ã‚’è¡Œã£ã¦ã„ã‚‹ã®ã§ã€ã“ã®ã‚³ãƒžãƒ³ãƒ‰å‰ã«ã¯ [macTransSet] ã¯æŒ‡å®šã™ã‚‹
;	ã€€å¿…è¦ã¯ã‚ã‚Šã¾ã›ã‚“
;	â€»å®šç¾©ã•ã‚Œã¦ã„ã‚‹è‰²ä¸€è¦§ (ä»–ã®è‰²ã¯ãƒ•ã‚©ãƒˆã‚·ãƒ§ãƒƒãƒ—ãªã©ã§èª¿ã¹ã¦æŒ‡å®šã—ã¦ãã ã•ã„)
;	ã€€çµ„ã¿è¾¼ã¿å´ã§å®šç¾©ã—ãªã„ã¨ä½¿ç”¨ã§ããªã„ã®ã§é€£çµ¡ãŠé¡˜ã„ã—ã¾ã™
;	ã€€coBLACK	= 0x000000
;	ã€€coWHITE	= 0xffffff
;	ã€€coRED		= 0xff0000
;	ã€€coGREEN	= 0x00ff00
;	ã€€coBLUE	= 0x0000ff
;	ã€€coAQUA	= 0x00ffff
;	ã€€coPURPLE	= 0xff00ff
;	ã€€coYELLOW	= 0xffff00

[macro name = macTransOut]
	
	;ç¾åœ¨ã®ç”»é¢ã‚’ã‚­ãƒ£ãƒ—ãƒãƒ£ãƒ¼ã™ã‚‹
	[macTransSet]
	
	;ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦è¨­å®šãŒ0(æ®‹ã•ãªã„)ã®å ´åˆ
	[macWindowView type=%mes|0]
	
	;ç”»åƒ å…¨æ¶ˆã—
	[macImageFree layer=-1]
	
	;è‰²æŒ‡å®šã—ãŸå ´åˆ
	[macImageFill color=%color|coBLACK]
	
	;æ™‚é–“æŒ‡å®šã—ãŸå ´åˆ
	[macTrans file=%file time=%time|1000]
	
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ã‚¯ã‚§ã‚¤ã‚¯
;		[time]		: å®Œäº†ã¾ã§ã®æ™‚é–“ [mså˜ä½] (def:500ms)
;		[x]			: ï¼¸æºã‚Œå¹… (def:0)
;		[y]			: ï¼¹æºã‚Œå¹… (def:0)
;		[mode]		: ãƒ¢ãƒ¼ãƒ‰ (def:0) 0:é€šå¸¸
;									 1:ç”»é¢å¤–å˜è‰²å¡—ã‚Šã¤ã¶ã—
;		[color]		: è‰²å€¤(16é€²æ•°ã§æŒ‡å®š) (def:coBLACK)

;	â€»ç”»é¢å…¨ä½“ã‚’æºã‚‰ã—ã¾ã™
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã¯ã€ã‚¯ã‚§ã‚¤ã‚¯çµ‚äº†ã‚’å¾…ã£ã¦ã‹ã‚‰ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’è¡¨ç¤ºã—ã¾ã™
;	â€»[ç”»é¢å¤–å˜è‰²å¡—ã‚Šã¤ã¶ã—]ã¯èƒŒæ™¯ãŒç”»é¢ä¸€æ¯ã®ã‚µã‚¤ã‚ºã—ã‹ãªã„å ´åˆã€
;	ã€€ãšã‚ŒãŸéš›ã«è¦‹ãˆã‚‹ç”»é¢ã®è‰²ã‚’æŒ‡å®šã—ã¾ã™

[macro name = macQuake]
	[quake time=%time|500 hmax=%x|0 vmax=%y|0 mode=%mode|0 color=%color|coBLACK]
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ç”»åƒãƒ¬ã‚¤ãƒ¤å˜ä½ã®æºã‚‰ã—
;		[layer]		: ãƒ¬ã‚¤ãƒ¤ç•ªå· (def:0 æŒ‡å®šå¯èƒ½ç•ªå·ã¯SYSTEMè¨­å®šè€…ã«ç¢ºèª)
;		x			: æºã‚Œå¹…ï¼¸ ( - æŒ‡å®šã§å·¦ã€+ æŒ‡å®š( + ã¯çœç•¥å¯)ã§å³)
;		y			: æºã‚Œå¹…ï¼¹ ( - æŒ‡å®šã§ä¸Šã€+ æŒ‡å®š( + ã¯çœç•¥å¯)ã§ä¸‹)
;		[type]		: s:å˜æ–¹å‘ w:åŒæ–¹å‘ (def:s)
;		[cnt]		: æºã‚‰ã—å›žæ•° (def:1)
;		[time]		: ç§»å‹•æ™‚é–“ [mså˜ä½] (def:220)
;		[delay]		: ç§»å‹•é–‹å§‹ã¾ã§ã®å¾…ã¡æ™‚é–“ [mså˜ä½] (def:0)
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã¯ã€æºã‚‰ã—çµ‚äº†ã‚’å¾…ã£ã¦ã‹ã‚‰ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’è¡¨ç¤ºã—ã¾ã™
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã®å¾Œã«ã¯ã€[macWaitMove]ã‚³ãƒžãƒ³ãƒ‰ã‚’å…¥ã‚Œã¦ãã ã•ã„
;	â€»è¤‡æ•°ãƒ¬ã‚¤ãƒ¤ã‚’åŒæ™‚ã«æºã‚‰ã™å ´åˆã¯[macWaitMove]ã‚³ãƒžãƒ³ãƒ‰ã®å…¥ã‚Œæ–¹ã«æ³¨æ„ã—ã¦ãã ã•ã„

[macro name = macImageShake]
	[SpPath x=%x y=%y cnt=%cnt|1 layer=%layer|0 type=%type|s]
	[imagespmove layer=%layer|0 path="&f.path" time=%time|220 delay=%delay|0 functype=0]
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ç”»åƒé€éŽåº¦è¨­å®š
;		[layer]		: ãƒ¬ã‚¤ãƒ¤ç•ªå· (def:0 æŒ‡å®šå¯èƒ½ç•ªå·ã¯SYSTEMè¨­å®šè€…ã«ç¢ºèª)
;		opacity		: é€éŽåº¦ (é€æ˜Ž0ï½žä¸é€æ˜Ž255ã®çµ¶å¯¾æŒ‡å®š)
;		[time]		: æŒ‡å®šé€éŽåº¦ã«ã‹ã‹ã‚‹ã¾ã§ã®æ™‚é–“(def:0)
;	â€»ç”»åƒãƒ¬ã‚¤ãƒ¤ã®é€éŽåº¦ã‚’è¨­å®šã—ã¾ã™ã€‚
;	[macWaitMove]ã¨ã‚»ãƒƒãƒˆã§ä½¿ç”¨ã—ã¦ãã ã•ã„ã€‚

[macro name = macImageOpacity]
;	é€éŽåº¦ã®ç¾åœ¨å€¤ã‚’ä»£å…¥
	[imagemove layer=%layer|0 x=0 y=0 opacity=%opacity time=%time|0 delay=0 accel=0]
[endmacro]

;-------------------------------------------------------------------------------

;	â—‹ãƒ•ãƒ©ãƒƒã‚·ãƒ¥
;		[color]		: è‰²å€¤(16é€²æ•°ã§æŒ‡å®š) (def:coWHITE)
;		[nun]		: å›žæ•° (def:1)
;		[time]		: ç‚¹æ»…æ™‚é–“ [mså˜ä½] (def:300ms)


;	â€»ç”»é¢å…¨ä½“ã‚’ãƒ•ãƒ©ãƒƒã‚·ãƒ¥ã•ã›ã¾ã™
;	â€»ã“ã®ã‚³ãƒžãƒ³ãƒ‰ã¯ã€ãƒ•ãƒ©ãƒƒã‚·ãƒ¥çµ‚äº†ã‚’å¾…ã£ã¦ã‹ã‚‰ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’è¡¨ç¤ºã—ã¾ã™

[macro name = macFlash]
	[flash color=%color|coWHITE num=%num|1 time=%time|300]
[endmacro]

;-------------------------------------------------------------------------------








[return]

